
# State **`s3://infrahouse-aws-control-493370826424/terraform.tfstate`**
## Affected resources counts

|  Success  |   🟢 Add |   🟡 Change |   🔴 Destroy |
|:---------:|--------:|-----------:|------------:|
|     ✅     |       2 |          2 |           1 |
## Affected resources by action

|  Action  | Resources                          |
|:--------:|:-----------------------------------|
|    🟢     | `aws_s3_bucket.terraform-registry` |
|    🟡     | `aws_iam_policy.registry_node`     |
|    🟡     | `module.ecs.aws_ecs_service.ecs`   |
<details>
<summary>STDOUT</summary>

```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.registry_node_permissions will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "registry_node_permissions" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "dynamodb:*",
            ]
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "s3:*",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "s3:*",
            ]
          + resources = [
              + (known after apply),
            ]
        }
    }

  # aws_iam_policy.registry_node will be updated in-place
  ~ resource "aws_iam_policy" "registry_node" {
        id          = "arn:aws:iam::493370826424:policy/registry-node-20240303052126090300000001"
        name        = "registry-node-20240303052126090300000001"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "dynamodb:*"
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags        = {}
        # (5 unchanged attributes hidden)
    }

  # aws_s3_bucket.terraform-registry will be created
  + resource "aws_s3_bucket" "terraform-registry" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = (known after apply)
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = "infrahouse-terraform-registry-"
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = {
          + "created_by"  = "infrahouse/aws-control-493370826424"
          + "environment" = "production"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # module.ecs.aws_ecs_service.ecs will be updated in-place
  ~ resource "aws_ecs_service" "ecs" {
        id                                 = "arn:aws:ecs:us-west-1:493370826424:service/terraform-registry/terraform-registry"
        name                               = "terraform-registry"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:us-west-1:493370826424:task-definition/terraform-registry:8" -> (known after apply)
        # (13 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.ecs.aws_ecs_task_definition.ecs must be replaced
-/+ resource "aws_ecs_task_definition" "ecs" {
      ~ arn                      = "arn:aws:ecs:us-west-1:493370826424:task-definition/terraform-registry:8" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-west-1:493370826424:task-definition/terraform-registry" -> (known after apply)
      ~ container_definitions    = (sensitive value) # forces replacement
      ~ id                       = "terraform-registry" -> (known after apply)
      + network_mode             = (known after apply)
      - requires_compatibilities = [] -> null
      ~ revision                 = 8 -> (known after apply)
      - tags                     = {} -> null
        # (6 unchanged attributes hidden)
    }

Plan: 2 to add, 2 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan"
::debug::Terraform exited with code 0.
::debug::stdout: data.terraform_remote_state.cicd: Reading...%0Amodule.ecs.data.cloudinit_config.ecs: Reading...%0Amodule.keycloak.data.cloudinit_config.ecs: Reading...%0Amodule.ecs.data.cloudinit_config.ecs: Read complete after 0s [id=4217720379]%0Amodule.keycloak.data.cloudinit_config.ecs: Read complete after 0s [id=1466757517]%0Amodule.jumphost.random_string.asg_name: Refreshing state... [id=02R7BZ]%0Amodule.jumphost.random_string.profile-suffix: Refreshing state... [id=Zv01ElhajbB6]%0Arandom_password.keycloak_admin_password: Refreshing state... [id=none]%0Arandom_password.keycloak_service: Refreshing state... [id=none]%0Arandom_pet.keycloak_admin_username: Refreshing state... [id=accepted-asp]%0Amodule.release_infrahouse_com["jammy"].random_password.passphrase: Refreshing state... [id=none]%0Amodule.release_infrahouse_com["focal"].random_password.passphrase: Refreshing state... [id=none]%0Amodule.release_infrahouse_com["focal"].aws_acm_certificate.repo: Refreshing state... [id=arn:aws:acm:us-east-1:493370826424:certificate/2eed53d3-e1ad-4743-ace5-89c193cd3c65]%0Amodule.release_infrahouse_com["jammy"].aws_acm_certificate.repo: Refreshing state... [id=arn:aws:acm:us-east-1:493370826424:certificate/402852e1-7054-4cea-80ac-3ccbee72a398]%0Adata.aws_region.current: Reading...%0Aaws_secretsmanager_secret.keycloak_service: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:493370826424:secret:keycloak_service20240303174856808900000002-K6ZwdC]%0Adata.aws_caller_identity.current: Reading...%0Adata.aws_region.current: Read complete after 0s [id=us-west-1]%0Amodule.keycloak.data.aws_iam_policy_document.assume_role_policy: Reading...%0Amodule.release_infrahouse_com["focal"].aws_secretsmanager_secret.key: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:493370826424:secret:packager-key-focal-XrTWrP]%0Amodule.release_infrahouse_com["jammy"].aws_secretsmanager_secret.key: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:493370826424:secret:packager-key-jammy-XrTWrP]%0Amodule.jumphost.data.aws_iam_policy_document.jumphost_permissions: Reading...%0Adata.aws_iam_policy.administrator-access: Reading...%0Amodule.release_infrahouse_com["focal"].aws_cloudfront_cache_policy.default: Refreshing state... [id=5db494dd-546b-4231-a0c7-133b245ada49]%0Amodule.release_infrahouse_com["jammy"].aws_cloudfront_cache_policy.default: Refreshing state... [id=b04aff45-48e1-4501-90d3-998c9fa1f264]%0Amodule.keycloak.data.aws_iam_policy_document.assume_role_policy: Read complete after 0s [id=1077804475]%0Amodule.jumphost.data.aws_iam_policy_document.jumphost_permissions: Read complete after 0s [id=2218315402]%0Amodule.jumphost.module.jumphost_userdata.data.aws_region.current: Reading...%0Amodule.jumphost.data.aws_caller_identity.current: Reading...%0Amodule.jumphost.module.jumphost_userdata.data.aws_region.current: Read complete after 0s [id=us-west-1]%0Amodule.ecs.aws_ecs_cluster.ecs: Refreshing state... [id=arn:aws:ecs:us-west-1:493370826424:cluster/terraform-registry]%0Adata.aws_caller_identity.current: Read complete after 0s [id=493370826424]%0Amodule.ih-tf-aws-control-493370826424-admin.data.aws_iam_policy.admin: Reading...%0Amodule.jumphost.data.aws_caller_identity.current: Read complete after 0s [id=493370826424]%0Aaws_iam_policy.registry_node: Refreshing state... [id=arn:aws:iam::493370826424:policy/registry-node-20240303052126090300000001]%0Amodule.ecs.module.pod.module.webserver_profile.data.aws_iam_policy_document.assume: Reading...%0Amodule.ecs.module.pod.module.webserver_profile.data.aws_iam_policy_document.assume: Read complete after 0s [id=2851119427]%0Amodule.puppet-code-github.data.aws_iam_openid_connect_provider.github: Reading...%0Amodule.keycloak.module.pod.module.webserver_profile.data.aws_iam_policy_document.assume: Reading...%0Amodule.keycloak.module.pod.module.webserver_profile.data.aws_iam_policy_document.assume: Read complete after 0s [id=2851119427]%0Adata.aws_ami.ubuntu_22: Reading...%0Amodule.ecs.data.aws_ami.ecs: Reading...%0Amodule.puppet-code-github.data.aws_iam_openid_connect_provider.github: Read complete after 1s [id=arn:aws:iam::493370826424:oidc-provider/token.actions.githubusercontent.com]%0Amodule.keycloak.aws_ecs_cluster.ecs: Refreshing state... [id=arn:aws:ecs:us-west-1:493370826424:cluster/auth]%0Amodule.ecs.data.aws_caller_identity.current: Reading...%0Amodule.jumphost.module.jumphost_profile.data.aws_iam_policy_document.assume: Reading...%0Amodule.jumphost.module.jumphost_profile.data.aws_iam_policy_document.assume: Read complete after 0s [id=2851119427]%0Amodule.keycloak.data.aws_iam_policy.ecs-task-execution-role-policy: Reading...%0Amodule.keycloak.module.pod.data.aws_caller_identity.current: Reading...%0Amodule.infrahouse-toolkit-github.data.aws_iam_openid_connect_provider.github: Reading...%0Amodule.ecs.data.aws_caller_identity.current: Read complete after 0s [id=493370826424]%0Amodule.ih-tf-infrahouse-website-infra-admin.data.aws_iam_policy.admin: Reading...%0Amodule.infrahouse-toolkit-github.data.aws_iam_openid_connect_provider.github: Read complete after 0s [id=arn:aws:iam::493370826424:oidc-provider/token.actions.githubusercontent.com]%0Amodule.management.aws_vpc.vpc: Refreshing state... [id=vpc-08e19d859c26d18b2]%0Amodule.keycloak.module.pod.data.aws_caller_identity.current: Read complete after 0s [id=493370826424]%0Amodule.keycloak.data.aws_ami.ecs: Reading...%0Aaws_secretsmanager_secret.keycloak_admin_creds: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:493370826424:secret:keycloak_admin_credentials20240302224352142500000001-qkfcxd]%0Adata.aws_ami.ubuntu_22: Read complete after 1s [id=ami-05c969369880fa2c2]%0Amodule.ih-tf-infrahouse-website-infra-admin.data.aws_iam_policy_document.github-permissions: Reading...%0Amodule.ih-tf-infrahouse-website-infra-admin.data.aws_iam_policy_document.github-permissions: Read complete after 0s [id=1585346832]%0Aaws_key_pair.aleks: Refreshing state... [id=aleks]%0Amodule.ecs.module.pod.data.aws_caller_identity.current: Reading...%0Amodule.ecs.data.aws_ami.ecs: Read complete after 0s [id=ami-0c535e24abbf12738]%0Amodule.keycloak.data.aws_iam_policy_document.instance_policy: Reading...%0Amodule.keycloak.data.aws_iam_policy_document.instance_policy: Read complete after 0s [id=1552918899]%0Amodule.ih-tf-aws-control-493370826424-admin.data.aws_iam_policy_document.github-permissions: Reading...%0Amodule.ih-tf-aws-control-493370826424-admin.data.aws_iam_policy_document.github-permissions: Read complete after 0s [id=83731904]%0Amodule.ecs.data.aws_iam_policy.ecs-task-execution-role-policy: Reading...%0Amodule.ecs.module.pod.data.aws_caller_identity.current: Read complete after 0s [id=493370826424]%0Amodule.keycloak.data.aws_caller_identity.current: Reading...%0Adata.terraform_remote_state.cicd: Read complete after 1s%0Amodule.infrahouse_com.aws_route53_zone.infrahouse_com: Refreshing state... [id=Z07662251LH3YRF2ERM3G]%0Adata.aws_iam_policy.administrator-access: Read complete after 1s [id=arn:aws:iam::aws:policy/AdministratorAccess]%0Amodule.jumphost.data.aws_ami.ubuntu: Reading...%0Amodule.ih-tf-aws-control-493370826424-admin.data.aws_iam_policy.admin: Read complete after 1s [id=arn:aws:iam::aws:policy/AdministratorAccess]%0Aaws_key_pair.aleks-Black-MBP: Refreshing state... [id=aleks-Black-MBP]%0Amodule.keycloak.data.aws_caller_identity.current: Read complete after 0s [id=493370826424]%0Amodule.ecs.data.aws_iam_policy_document.instance_policy: Reading...%0Amodule.ecs.data.aws_iam_policy_document.instance_policy: Read complete after 0s [id=1552918899]%0Amodule.jumphost.aws_efs_file_system.home: Refreshing state... [id=fs-0cbd3749548d04da6]%0Amodule.ecs.data.aws_iam_policy_document.assume_role_policy: Reading...%0Amodule.ecs.data.aws_iam_policy_document.assume_role_policy: Read complete after 0s [id=1077804475]%0Amodule.keycloak.data.aws_region.current: Reading...%0Amodule.keycloak.data.aws_region.current: Read complete after 0s [id=us-west-1]%0Amodule.release_infrahouse_com["jammy"].aws_cloudfront_origin_access_control.repo-storage: Refreshing state... [id=E19JUOM5WL9R3Q]%0Amodule.keycloak.data.aws_ami.ecs: Read complete after 0s [id=ami-0c535e24abbf12738]%0Aaws_secretsmanager_secret.registry_client_secret: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:493370826424:secret:registry_client_secret20240302203708051000000001-UA4zRE]%0Amodule.release_infrahouse_com["focal"].aws_cloudfront_origin_access_control.repo-storage: Refreshing state... [id=EMY4YRQBY9A64]%0Amodule.release_infrahouse_com["jammy"].aws_cloudfront_function.http_auth: Refreshing state... [id=release-jammy_infrahouse_com-auth]%0Amodule.release_infrahouse_com["focal"].aws_cloudfront_function.http_auth: Refreshing state... [id=release-focal_infrahouse_com-auth]%0Amodule.ecs.data.aws_region.current: Reading...%0Amodule.ecs.data.aws_region.current: Read complete after 0s [id=us-west-1]%0Adata.aws_availability_zones.uw1: Reading...%0Amodule.infrahouse-puppet-data-github.data.aws_iam_openid_connect_provider.github: Reading...%0Amodule.jumphost.data.aws_ami.ubuntu: Read complete after 0s [id=ami-05c969369880fa2c2]%0Amodule.github-connector.aws_iam_openid_connect_provider.github: Refreshing state... [id=arn:aws:iam::493370826424:oidc-provider/token.actions.githubusercontent.com]%0Adata.aws_availability_zones.uw1: Read complete after 0s [id=us-west-1]%0Amodule.release_infrahouse_com["jammy"].aws_s3_bucket.repo: Refreshing state... [id=infrahouse-release-jammy]%0Amodule.release_infrahouse_com["focal"].aws_s3_bucket.repo: Refreshing state... [id=infrahouse-release-focal]%0Amodule.keycloak.data.aws_iam_policy.ecs-task-execution-role-policy: Read complete after 0s [id=arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy]%0Amodule.jumphost.data.aws_region.current: Reading...%0Amodule.infrahouse-puppet-data-github.data.aws_iam_openid_connect_provider.github: Read complete after 0s [id=arn:aws:iam::493370826424:oidc-provider/token.actions.githubusercontent.com]%0Amodule.jumphost.data.aws_region.current: Read complete after 0s [id=us-west-1]%0Amodule.release_infrahouse_com["focal"].aws_secretsmanager_secret.passphrase: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:493370826424:secret:packager-passphrase-focal-gzxQPq]%0Amodule.release_infrahouse_com["focal"].aws_s3_bucket.repo-logs: Refreshing state... [id=infrahouse-release-focal-logs]%0Amodule.ih-tf-infrahouse-website-infra-admin.data.aws_iam_policy.admin: Read complete after 0s [id=arn:aws:iam::aws:policy/AdministratorAccess]%0Amodule.release_infrahouse_com["jammy"].aws_secretsmanager_secret.passphrase: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:493370826424:secret:packager-passphrase-jammy-xa6PTG]%0Amodule.release_infrahouse_com["jammy"].aws_s3_bucket.repo-logs: Refreshing state... [id=infrahouse-release-jammy-logs]%0Amodule.keycloak.aws_iam_role.ecs_task_execution_role: Refreshing state... [id=authTaskExecutionRole]%0Adata.aws_iam_policy_document.registry_node_assume: Reading...%0Adata.aws_iam_policy_document.registry_node_assume: Read complete after 0s [id=3719449782]%0Amodule.ecs.module.pod.module.webserver_profile.aws_iam_role.profile: Refreshing state... [id=terraform-registry_instance20240302194935069800000007]%0Amodule.keycloak.module.pod.module.webserver_profile.aws_iam_role.profile: Refreshing state... [id=auth_instance20240302223634852000000001]%0Amodule.puppet-code-github.data.aws_iam_policy_document.github-trust: Reading...%0Amodule.puppet-code-github.data.aws_iam_policy_document.github-trust: Read complete after 0s [id=2423520793]%0Aaws_secretsmanager_secret_version.keycloak_service: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:493370826424:secret:keycloak_service20240303174856808900000002-K6ZwdC|terraform-20240303174857073500000005]%0Amodule.ecs.data.aws_iam_policy.ecs-task-execution-role-policy: Read complete after 1s [id=arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy]%0Amodule.jumphost.module.jumphost_profile.aws_iam_role.profile: Refreshing state... [id=jumphost-Zv01ElhajbB620240223005112032800000005]%0Amodule.infrahouse-toolkit-github.data.aws_iam_policy_document.github-trust: Reading...%0Amodule.infrahouse-toolkit-github.data.aws_iam_policy_document.github-trust: Read complete after 0s [id=4107919091]%0Amodule.ih-tf-infrahouse-website-infra-admin.aws_iam_policy.github: Refreshing state... [id=arn:aws:iam::493370826424:policy/ih-tf-infrahouse-website-infra-github]%0Aaws_secretsmanager_secret_version.keycloak_admin_creds: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:493370826424:secret:keycloak_admin_credentials20240302224352142500000001-qkfcxd|terraform-20240302224352723300000003]%0Amodule.ih-tf-aws-control-493370826424-admin.aws_iam_policy.github: Refreshing state... [id=arn:aws:iam::493370826424:policy/ih-tf-aws-control-493370826424-github]%0Adata.aws_route53_zone.cicd-ih-com: Reading...%0Amodule.ecs.aws_iam_role.ecs_task_execution_role: Refreshing state... [id=terraform-registryTaskExecutionRole]%0Amodule.infrahouse_com.aws_route53_record.mx: Refreshing state... [id=Z07662251LH3YRF2ERM3G_infrahouse.com_MX]%0Amodule.infrahouse_com.aws_route53_record.spf: Refreshing state... [id=Z07662251LH3YRF2ERM3G_infrahouse.com_SPF]%0Amodule.infrahouse_com.aws_route53_record.txt_spf: Refreshing state... [id=Z07662251LH3YRF2ERM3G_infrahouse.com_TXT]%0Amodule.infrahouse_com.aws_route53_record.txt_dkim: Refreshing state... [id=Z07662251LH3YRF2ERM3G_google._domainkey.infrahouse.com_TXT]%0Adata.aws_secretsmanager_secret_version.registry_client_secret: Reading...%0Amodule.infrahouse-puppet-data-github.data.aws_iam_policy_document.github-trust: Reading...%0Amodule.infrahouse-puppet-data-github.data.aws_iam_policy_document.github-trust: Read complete after 0s [id=290351380]%0Amodule.jumphost.module.jumphost_profile.aws_iam_policy.profile: Refreshing state... [id=arn:aws:iam::493370826424:policy/jumphost-Zv01ElhajbB620240223005112022800000002]%0Adata.aws_route53_zone.cicd-ih-com: Read complete after 0s [id=Z06790082OU0POPWOCPZ4]%0Aaws_iam_role.registry-node: Refreshing state... [id=registry-node-20240303052126090700000002]%0Amodule.release_infrahouse_com["jammy"].aws_secretsmanager_secret_version.passphrase: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:493370826424:secret:packager-passphrase-jammy-xa6PTG|D6ABCB2B-F850-4487-A764-07263736323E]%0Amodule.release_infrahouse_com["focal"].aws_secretsmanager_secret_version.passphrase: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:493370826424:secret:packager-passphrase-focal-gzxQPq|6586EB13-79C2-424D-AFED-6810E61156D7]%0Adata.aws_secretsmanager_secret_version.registry_client_secret: Read complete after 0s [id=arn:aws:secretsmanager:us-west-1:493370826424:secret:registry_client_secret20240302203708051000000001-UA4zRE|AWSCURRENT]%0Amodule.puppet-code-github.aws_iam_role.github: Refreshing state... [id=ih-tf-puppet-code-github]%0Amodule.keycloak.aws_iam_role_policy_attachment.ecs_task_execution_role_policy: Refreshing state... [id=authTaskExecutionRole-20240302223635181000000008]%0Amodule.infrahouse-toolkit-github.aws_iam_role.github: Refreshing state... [id=ih-tf-infrahouse-toolkit-github]%0Amodule.ecs.module.pod.module.webserver_profile.aws_iam_instance_profile.profile: Refreshing state... [id=terraform-registry_instance]%0Amodule.keycloak.module.pod.module.webserver_profile.aws_iam_instance_profile.profile: Refreshing state... [id=auth_instance]%0Amodule.ecs.module.pod.data.aws_ami.selected: Reading...%0Amodule.keycloak.module.pod.data.aws_ami.selected: Reading...%0Amodule.keycloak.data.aws_key_pair.ssh_key_pair: Reading...%0Amodule.ecs.data.aws_key_pair.ssh_key_pair: Reading...%0Amodule.jumphost.module.jumphost_profile.aws_iam_instance_profile.profile: Refreshing state... [id=jumphost-Zv01ElhajbB6]%0Amodule.ecs.aws_iam_role_policy_attachment.ecs_task_execution_role_policy: Refreshing state... [id=terraform-registryTaskExecutionRole-20240302194935897700000009]%0Amodule.management.aws_default_route_table.default: Refreshing state... [id=rtb-0d73383afeb6ad142]%0Amodule.ecs.module.pod.data.aws_ami.selected: Read complete after 0s [id=ami-0c535e24abbf12738]%0Amodule.management.aws_internet_gateway.ig: Refreshing state... [id=igw-079090e09ed5db582]%0Amodule.keycloak.data.aws_key_pair.ssh_key_pair: Read complete after 0s [id=key-09febf212ac7461a1]%0Amodule.management.aws_default_security_group.default: Refreshing state... [id=sg-08b960b85f5996100]%0Amodule.keycloak.module.pod.data.aws_ami.selected: Read complete after 0s [id=ami-0c535e24abbf12738]%0Amodule.management.aws_subnet.all["10.0.3.0/24"]: Refreshing state... [id=subnet-06caf71c8b0afd909]%0Amodule.management.aws_subnet.all["10.0.0.0/24"]: Refreshing state... [id=subnet-0df885dcc99418799]%0Amodule.ecs.data.aws_key_pair.ssh_key_pair: Read complete after 0s [id=key-09febf212ac7461a1]%0Amodule.management.aws_subnet.all["10.0.1.0/24"]: Refreshing state... [id=subnet-0f91dd2675e7a16c3]%0Amodule.management.aws_subnet.all["10.0.2.0/24"]: Refreshing state... [id=subnet-04b8845d896c6ebde]%0Amodule.management.aws_route_table.all["10.0.1.0/24"]: Refreshing state... [id=rtb-067c30e65dd4108e9]%0Amodule.management.aws_route_table.all["10.0.2.0/24"]: Refreshing state... [id=rtb-0ac1c23091a58b0bd]%0Amodule.management.aws_route_table.all["10.0.3.0/24"]: Refreshing state... [id=rtb-032c75541921bd8f1]%0Amodule.management.aws_route_table.all["10.0.0.0/24"]: Refreshing state... [id=rtb-04a16e74d5b12a338]%0Adata.aws_iam_policy_document.infrahouse-com-github-assume: Reading...%0Adata.aws_iam_policy_document.infrahouse-com-github-assume: Read complete after 0s [id=1754214164]%0Amodule.infrahouse-puppet-data-github.aws_iam_role.github: Refreshing state... [id=ih-tf-infrahouse-puppet-data-github]%0Aaws_route53_record.ci-cd-ns: Refreshing state... [id=Z07662251LH3YRF2ERM3G_ci-cd.infrahouse.com_NS]%0Amodule.jumphost.module.jumphost_profile.aws_iam_role_policy_attachment.profile: Refreshing state... [id=jumphost-Zv01ElhajbB620240223005112032800000005-20240223005112691200000007]%0Aaws_iam_role_policy_attachment.task_role: Refreshing state... [id=registry-node-20240303052126090700000002-20240303052126601400000003]%0Amodule.keycloak.module.pod.module.webserver_profile.aws_iam_policy.profile: Refreshing state... [id=arn:aws:iam::493370826424:policy/auth_instance20240302223634853400000003]%0Amodule.ecs.module.pod.module.webserver_profile.aws_iam_policy.profile: Refreshing state... [id=arn:aws:iam::493370826424:policy/terraform-registry_instance20240302194935067200000001]%0Amodule.jumphost.data.aws_route53_zone.jumphost_zone: Reading...%0Amodule.release_infrahouse_com["jammy"].aws_route53_record.cert_validation["release-jammy.infrahouse.com"]: Refreshing state... [id=Z07662251LH3YRF2ERM3G__047ae29925ec0297eaebfeddc886f234.release-jammy.infrahouse.com._CNAME]%0Amodule.release_infrahouse_com["focal"].aws_route53_record.cert_validation["release-focal.infrahouse.com"]: Refreshing state... [id=Z07662251LH3YRF2ERM3G__87f2ead3abf68134c497bf52718e07b1.release-focal.infrahouse.com._CNAME]%0Aaws_security_group.keycloak: Refreshing state... [id=sg-07422812729e6d2e1]%0Amodule.management.aws_eip.nat_eip["10.0.2.0/24"]: Refreshing state... [id=eipalloc-0a3949a8a5f094171]%0Amodule.management.aws_eip.nat_eip["10.0.0.0/24"]: Refreshing state... [id=eipalloc-02b42e70d52a5db7f]%0Amodule.management.aws_route.default_main: Refreshing state... [id=r-rtb-0d73383afeb6ad1421080289494]%0Amodule.ih-tf-aws-control-493370826424-admin.data.aws_iam_policy_document.github-assume: Reading...%0Amodule.ih-tf-aws-control-493370826424-admin.data.aws_iam_policy_document.github-assume: Read complete after 0s [id=3911844868]%0Amodule.ih-tf-infrahouse-website-infra-admin.data.aws_iam_policy_document.github-assume: Reading...%0Amodule.ih-tf-infrahouse-website-infra-admin.data.aws_iam_policy_document.github-assume: Read complete after 0s [id=709841391]%0Amodule.management.aws_vpc_security_group_egress_rule.default[0]: Refreshing state... [id=sgr-0e1eea4ce5b798046]%0Amodule.management.aws_vpc_security_group_ingress_rule.default[0]: Refreshing state... [id=sgr-06140053abc62a119]%0Aaws_iam_role.infrahouse-com-github: Refreshing state... [id=infrahouse-com-github]%0Amodule.jumphost.module.jumphost_userdata.data.cloudinit_config.config: Reading...%0Amodule.jumphost.module.jumphost_userdata.data.cloudinit_config.config: Read complete after 0s [id=1709618770]%0Amodule.jumphost.data.aws_route53_zone.jumphost_zone: Read complete after 0s [id=Z07662251LH3YRF2ERM3G]%0Amodule.ecs.aws_ecs_task_definition.ecs: Refreshing state... [id=terraform-registry]%0Amodule.ecs.module.pod.data.aws_route53_zone.webserver_zone: Reading...%0Amodule.management.aws_route_table_association.private_rt_assoc["10.0.1.0/24"]: Refreshing state... [id=rtbassoc-099b958af19485f2b]%0Amodule.management.aws_route_table_association.private_rt_assoc["10.0.2.0/24"]: Refreshing state... [id=rtbassoc-01521500562fd17b0]%0Amodule.management.aws_route_table_association.private_rt_assoc["10.0.3.0/24"]: Refreshing state... [id=rtbassoc-03418f8ebac8aa40b]%0Amodule.management.aws_route_table_association.private_rt_assoc["10.0.0.0/24"]: Refreshing state... [id=rtbassoc-08a410160e2dcc592]%0Amodule.management.aws_route.subnet_public["10.0.2.0/24"]: Refreshing state... [id=r-rtb-0ac1c23091a58b0bd1080289494]%0Amodule.management.aws_route.subnet_public["10.0.0.0/24"]: Refreshing state... [id=r-rtb-04a16e74d5b12a3381080289494]%0Amodule.keycloak.module.pod.data.aws_route53_zone.webserver_zone: Reading...%0Amodule.ecs.module.pod.data.aws_route53_zone.webserver_zone: Read complete after 0s [id=Z07662251LH3YRF2ERM3G]%0Amodule.keycloak.module.pod.module.webserver_profile.aws_iam_role_policy_attachment.profile: Refreshing state... [id=auth_instance20240302223634852000000001-20240302223635213800000009]%0Amodule.ecs.module.pod.module.webserver_profile.aws_iam_role_policy_attachment.profile: Refreshing state... [id=terraform-registry_instance20240302194935069800000007-20240302194935884600000008]%0Amodule.ih-tf-aws-control-493370826424-admin.aws_iam_role.github: Refreshing state... [id=ih-tf-aws-control-493370826424-github]%0Amodule.ih-tf-infrahouse-website-infra-admin.aws_iam_role.github: Refreshing state... [id=ih-tf-infrahouse-website-infra-github]%0Amodule.release_infrahouse_com["jammy"].aws_acm_certificate_validation.repo: Refreshing state... [id=2023-07-24 18:51:39.051 +0000 UTC]%0Amodule.release_infrahouse_com["focal"].aws_acm_certificate_validation.repo: Refreshing state... [id=2023-07-24 18:51:39.442 +0000 UTC]%0Amodule.release_infrahouse_com["jammy"].aws_s3_bucket_public_access_block.repo: Refreshing state... [id=infrahouse-release-jammy]%0Amodule.release_infrahouse_com["focal"].aws_s3_bucket_public_access_block.repo: Refreshing state... [id=infrahouse-release-focal]%0Amodule.release_infrahouse_com["jammy"].aws_s3_object.distributions: Refreshing state... [id=conf/distributions]%0Amodule.release_infrahouse_com["focal"].aws_s3_object.distributions: Refreshing state... [id=conf/distributions]%0Amodule.keycloak.module.pod.data.aws_route53_zone.webserver_zone: Read complete after 0s [id=Z07662251LH3YRF2ERM3G]%0Amodule.release_infrahouse_com["jammy"].aws_s3_bucket_ownership_controls.repo: Refreshing state... [id=infrahouse-release-jammy]%0Amodule.release_infrahouse_com["focal"].aws_s3_bucket_ownership_controls.repo: Refreshing state... [id=infrahouse-release-focal]%0Aaws_db_subnet_group.keycloak: Refreshing state... [id=keycloak20240303174856808000000001]%0Amodule.management.aws_nat_gateway.nat_gw["10.0.0.0/24"]: Refreshing state... [id=nat-08fb9b52683277947]%0Amodule.management.aws_nat_gateway.nat_gw["10.0.2.0/24"]: Refreshing state... [id=nat-0d4e2ee96452d86fe]%0Amodule.ecs.module.pod.aws_acm_certificate.website: Refreshing state... [id=arn:aws:acm:us-west-1:493370826424:certificate/32a7b391-4cc3-48ff-8fc1-3f4994a9b351]%0Amodule.release_infrahouse_com["jammy"].aws_s3_bucket_ownership_controls.repo-logs: Refreshing state... [id=infrahouse-release-jammy-logs]%0Amodule.release_infrahouse_com["focal"].aws_s3_bucket_ownership_controls.repo-logs: Refreshing state... [id=infrahouse-release-focal-logs]%0Amodule.release_infrahouse_com["jammy"].aws_s3_bucket_logging.server-logs: Refreshing state... [id=infrahouse-release-jammy]%0Amodule.release_infrahouse_com["focal"].aws_s3_bucket_logging.server-logs: Refreshing state... [id=infrahouse-release-focal]%0Amodule.keycloak.module.pod.aws_acm_certificate.website: Refreshing state... [id=arn:aws:acm:us-west-1:493370826424:certificate/833268fe-cb8e-4613-97cb-1f1548952f1a]%0Aaws_vpc_security_group_ingress_rule.keycloak-icmp: Refreshing state... [id=sgr-03e32c947e95b9cfa]%0Aaws_vpc_security_group_ingress_rule.keycloak-mysql: Refreshing state... [id=sgr-06af05cc8afdfaeac]%0Aaws_vpc_security_group_egress_rule.keycloak_outgoing: Refreshing state... [id=sgr-078977813732a67bd]%0Amodule.ih-tf-infrahouse-website-infra-admin.data.aws_iam_policy_document.admin-assume: Reading...%0Amodule.ih-tf-infrahouse-website-infra-admin.data.aws_iam_policy_document.admin-assume: Read complete after 0s [id=2714260376]%0Amodule.ih-tf-infrahouse-website-infra-admin.aws_iam_role_policy_attachment.github: Refreshing state... [id=ih-tf-infrahouse-website-infra-github-20230818034150993400000001]%0Amodule.jumphost.data.aws_subnet.nlb_selected: Reading...%0Amodule.keycloak.data.aws_subnet.selected: Reading...%0Amodule.jumphost.data.aws_subnet.selected: Reading...%0Amodule.ecs.data.aws_subnet.selected: Reading...%0Amodule.ih-tf-aws-control-493370826424-admin.aws_iam_role_policy_attachment.github: Refreshing state... [id=ih-tf-aws-control-493370826424-github-20230817010818258200000001]%0Amodule.ih-tf-aws-control-493370826424-admin.data.aws_iam_policy_document.admin-assume: Reading...%0Amodule.ih-tf-aws-control-493370826424-admin.data.aws_iam_policy_document.admin-assume: Read complete after 0s [id=2899629952]%0Amodule.release_infrahouse_com["focal"].data.aws_iam_policy_document.bucket-admin[1]: Reading...%0Amodule.release_infrahouse_com["focal"].data.aws_iam_policy_document.bucket-admin[1]: Read complete after 0s [id=3967319674]%0Amodule.release_infrahouse_com["focal"].data.aws_iam_policy_document.bucket-admin[2]: Reading...%0Amodule.release_infrahouse_com["focal"].data.aws_iam_policy_document.bucket-admin[2]: Read complete after 0s [id=2166003714]%0Amodule.release_infrahouse_com["jammy"].data.aws_iam_policy_document.bucket-admin[0]: Reading...%0Amodule.release_infrahouse_com["jammy"].data.aws_iam_policy_document.bucket-admin[0]: Read complete after 0s [id=571510222]%0Amodule.release_infrahouse_com["jammy"].data.aws_iam_policy_document.bucket-admin[1]: Reading...%0Amodule.release_infrahouse_com["jammy"].data.aws_iam_policy_document.bucket-admin[1]: Read complete after 0s [id=1286761665]%0Amodule.keycloak.data.aws_subnet.selected: Read complete after 0s [id=subnet-0f91dd2675e7a16c3]%0Amodule.jumphost.data.aws_subnet.nlb_selected: Read complete after 0s [id=subnet-0df885dcc99418799]%0Amodule.release_infrahouse_com["jammy"].data.aws_iam_policy_document.bucket-admin[2]: Reading...%0Amodule.release_infrahouse_com["jammy"].data.aws_iam_policy_document.bucket-admin[2]: Read complete after 0s [id=62441911]%0Amodule.jumphost.data.aws_subnet.selected: Read complete after 0s [id=subnet-0f91dd2675e7a16c3]%0Amodule.release_infrahouse_com["focal"].data.aws_iam_policy_document.bucket-admin[0]: Reading...%0Amodule.management.aws_route.subnet_private["10.0.1.0/24"]: Refreshing state... [id=r-rtb-067c30e65dd4108e91080289494]%0Amodule.release_infrahouse_com["focal"].data.aws_iam_policy_document.bucket-admin[0]: Read complete after 0s [id=4198845318]%0Amodule.release_infrahouse_com["jammy"].aws_cloudfront_distribution.repo: Refreshing state... [id=E1IILWIY0OU78B]%0Amodule.management.aws_route.subnet_private["10.0.3.0/24"]: Refreshing state... [id=r-rtb-032c75541921bd8f11080289494]%0Amodule.release_infrahouse_com["focal"].aws_cloudfront_distribution.repo: Refreshing state... [id=E161QGCPE3JIOK]%0Amodule.ecs.data.aws_subnet.selected: Read complete after 0s [id=subnet-0f91dd2675e7a16c3]%0Amodule.release_infrahouse_com["jammy"].aws_s3_bucket_acl.repo-logs: Refreshing state... [id=infrahouse-release-jammy-logs,private]%0Amodule.release_infrahouse_com["focal"].aws_s3_bucket_acl.repo-logs: Refreshing state... [id=infrahouse-release-focal-logs,private]%0Amodule.ih-tf-infrahouse-website-infra-admin.aws_iam_role.admin: Refreshing state... [id=ih-tf-infrahouse-website-infra-admin]%0Amodule.release_infrahouse_com["jammy"].aws_s3_bucket_acl.repo: Refreshing state... [id=infrahouse-release-jammy,private]%0Amodule.release_infrahouse_com["focal"].aws_s3_bucket_acl.repo: Refreshing state... [id=infrahouse-release-focal,private]%0Amodule.ecs.module.pod.data.aws_subnet.selected: Reading...%0Amodule.keycloak.module.pod.data.aws_subnet.selected: Reading...%0Amodule.ih-tf-aws-control-493370826424-admin.aws_iam_role.admin: Refreshing state... [id=ih-tf-aws-control-493370826424-admin]%0Amodule.keycloak.aws_security_group.backend_extra: Refreshing state... [id=sg-08cca82b25623d4ee]%0Amodule.jumphost.data.aws_vpc.nlb_selected: Reading...%0Amodule.jumphost.aws_security_group.efs: Refreshing state... [id=sg-02906b36c9d1be156]%0Amodule.jumphost.aws_security_group.jumphost: Refreshing state... [id=sg-0bc8f2feda3620f6f]%0Amodule.jumphost.data.aws_vpc.selected: Reading...%0Amodule.keycloak.module.pod.data.aws_subnet.selected: Read complete after 0s [id=subnet-0df885dcc99418799]%0Amodule.ecs.aws_security_group.backend_extra: Refreshing state... [id=sg-0df97e04eee18cc72]%0Amodule.ecs.module.pod.data.aws_subnet.selected: Read complete after 0s [id=subnet-0df885dcc99418799]%0Amodule.release_infrahouse_com["jammy"].data.aws_iam_policy_document.bucket-cloudfront-access: Reading...%0Amodule.release_infrahouse_com["jammy"].data.aws_iam_policy_document.bucket-cloudfront-access: Read complete after 0s [id=133085117]%0Amodule.release_infrahouse_com["focal"].data.aws_iam_policy_document.bucket-cloudfront-access: Reading...%0Amodule.release_infrahouse_com["focal"].data.aws_iam_policy_document.bucket-cloudfront-access: Read complete after 0s [id=3872546644]%0Amodule.release_infrahouse_com["jammy"].aws_route53_record.repo: Refreshing state... [id=Z07662251LH3YRF2ERM3G_release-jammy.infrahouse.com_A]%0Amodule.release_infrahouse_com["focal"].aws_route53_record.repo: Refreshing state... [id=Z07662251LH3YRF2ERM3G_release-focal.infrahouse.com_A]%0Amodule.ecs.module.pod.aws_route53_record.cert_validation["registry.infrahouse.com"]: Refreshing state... [id=Z07662251LH3YRF2ERM3G__bec7dafd8b0071d5633275441f36976e.registry.infrahouse.com._CNAME]%0Amodule.ih-tf-infrahouse-website-infra-admin.aws_iam_role_policy_attachment.admin: Refreshing state... [id=ih-tf-infrahouse-website-infra-admin-20230818034158985100000002]%0Amodule.keycloak.module.pod.aws_route53_record.cert_validation["auth.infrahouse.com"]: Refreshing state... [id=Z07662251LH3YRF2ERM3G__896b3c1fdc69f951f23cbb89d74549e8.auth.infrahouse.com._CNAME]%0Amodule.ih-tf-aws-control-493370826424-admin.aws_iam_role_policy_attachment.admin: Refreshing state... [id=ih-tf-aws-control-493370826424-admin-20230709164321319900000001]%0Amodule.keycloak.module.pod.aws_security_group.alb: Refreshing state... [id=sg-04a8761a74826b4f8]%0Amodule.keycloak.module.pod.data.aws_vpc.service: Reading...%0Amodule.keycloak.module.pod.aws_alb_target_group.website: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-1:493370826424:targetgroup/tf-20240302223634861300000006/781ece90bddd8d59]%0Amodule.ecs.module.pod.aws_security_group.alb: Refreshing state... [id=sg-048f21fa3499d69af]%0Amodule.keycloak.module.pod.aws_security_group.backend: Refreshing state... [id=sg-06533e906d784b2a5]%0Amodule.ecs.module.pod.data.aws_vpc.service: Reading...%0Amodule.ecs.module.pod.aws_security_group.backend: Refreshing state... [id=sg-04b9363834e13a23e]%0Amodule.ecs.module.pod.aws_alb_target_group.website: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-1:493370826424:targetgroup/tf-20240302194935067400000002/c7f427e0e1d228fe]%0Amodule.release_infrahouse_com["jammy"].data.aws_iam_policy_document.bucket-access: Reading...%0Amodule.release_infrahouse_com["jammy"].data.aws_iam_policy_document.bucket-access: Read complete after 0s [id=2929434109]%0Amodule.release_infrahouse_com["focal"].data.aws_iam_policy_document.bucket-access: Reading...%0Amodule.release_infrahouse_com["focal"].data.aws_iam_policy_document.bucket-access: Read complete after 0s [id=4209130619]%0Amodule.release_infrahouse_com["jammy"].aws_s3_object.index-html: Refreshing state... [id=index.html]%0Amodule.release_infrahouse_com["focal"].aws_s3_object.index-html: Refreshing state... [id=index.html]%0Amodule.release_infrahouse_com["jammy"].aws_s3_object.deb-gpg-public-key: Refreshing state... [id=DEB-GPG-KEY-release-jammy.infrahouse.com]%0Amodule.release_infrahouse_com["focal"].aws_s3_object.deb-gpg-public-key: Refreshing state... [id=DEB-GPG-KEY-release-focal.infrahouse.com]%0Amodule.keycloak.aws_vpc_security_group_ingress_rule.backend_extra_reserved: Refreshing state... [id=sgr-08439d8ce172557ba]%0Amodule.jumphost.data.aws_vpc.nlb_selected: Read complete after 0s [id=vpc-08e19d859c26d18b2]%0Amodule.keycloak.aws_vpc_security_group_ingress_rule.backend_extra_user: Refreshing state... [id=sgr-0fb261fe3f35597f1]%0Amodule.jumphost.aws_vpc_security_group_egress_rule.efs: Refreshing state... [id=sgr-0db18bc63ee576445]%0Amodule.jumphost.aws_efs_mount_target.packages["subnet-06caf71c8b0afd909"]: Refreshing state... [id=fsmt-05668d06fda5b96b6]%0Amodule.jumphost.aws_efs_mount_target.packages["subnet-0f91dd2675e7a16c3"]: Refreshing state... [id=fsmt-0d025cfc9c7ee2852]%0Amodule.jumphost.data.aws_vpc.selected: Read complete after 0s [id=vpc-08e19d859c26d18b2]%0Amodule.jumphost.aws_vpc_security_group_ingress_rule.icmp: Refreshing state... [id=sgr-0335952ea4ac17465]%0Amodule.jumphost.aws_vpc_security_group_ingress_rule.efs_icmp: Refreshing state... [id=sgr-05152071ab2f7b9e3]%0Amodule.jumphost.aws_launch_template.jumphost: Refreshing state... [id=lt-001743d1d2257c40b]%0Amodule.jumphost.aws_vpc_security_group_egress_rule.default: Refreshing state... [id=sgr-09df3a8ea086f41c3]%0Amodule.keycloak.module.pod.data.aws_vpc.service: Read complete after 0s [id=vpc-08e19d859c26d18b2]%0Amodule.jumphost.aws_vpc_security_group_ingress_rule.ssh: Refreshing state... [id=sgr-08214d93ee7212b60]%0Amodule.ecs.module.pod.data.aws_vpc.service: Read complete after 0s [id=vpc-08e19d859c26d18b2]%0Amodule.jumphost.aws_lb.jumphost: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-1:493370826424:loadbalancer/net/jumpho20240226175403880200000003/b3fc749d99e1aea6]%0Aaws_db_instance.keycloak: Refreshing state... [id=db-WNYHTJJSQDZUAOJFDG4CDLIXPQ]%0Amodule.ecs.aws_vpc_security_group_ingress_rule.backend_extra_reserved: Refreshing state... [id=sgr-000ecebf750fc1bf1]%0Amodule.ecs.aws_vpc_security_group_ingress_rule.backend_extra_user: Refreshing state... [id=sgr-02b52993d3250d3a0]%0Amodule.keycloak.module.pod.aws_acm_certificate_validation.website: Refreshing state... [id=2024-03-02 22:36:51.087 +0000 UTC]%0Amodule.ecs.module.pod.aws_acm_certificate_validation.website: Refreshing state... [id=2024-03-02 19:49:53.063 +0000 UTC]%0Amodule.keycloak.module.pod.aws_vpc_security_group_egress_rule.alb_outgoing: Refreshing state... [id=sgr-08c12a045e8ba9745]%0Amodule.keycloak.module.pod.aws_alb.website: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-1:493370826424:loadbalancer/app/auth2024030222363678900000000a/a26578ce41c8310c]%0Amodule.keycloak.module.pod.aws_vpc_security_group_ingress_rule.alb_listener_port: Refreshing state... [id=sgr-0cc902990fde04156]%0Amodule.keycloak.module.pod.aws_vpc_security_group_ingress_rule.alb_icmp: Refreshing state... [id=sgr-05b0c467d0cc6084a]%0Amodule.keycloak.module.pod.aws_vpc_security_group_ingress_rule.https: Refreshing state... [id=sgr-08092ae9826c38ee9]%0Amodule.release_infrahouse_com["jammy"].aws_s3_bucket_policy.bucket-access: Refreshing state... [id=infrahouse-release-jammy]%0Amodule.release_infrahouse_com["focal"].aws_s3_bucket_policy.bucket-access: Refreshing state... [id=infrahouse-release-focal]%0Amodule.ecs.module.pod.aws_vpc_security_group_egress_rule.alb_outgoing: Refreshing state... [id=sgr-0ff88016915a07fda]%0Amodule.ecs.module.pod.aws_vpc_security_group_ingress_rule.alb_listener_port: Refreshing state... [id=sgr-0c5501ac99c777076]%0Amodule.ecs.module.pod.aws_alb.website: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-1:493370826424:loadbalancer/app/terraf2024030219493612940000000a/1f20b225c3278266]%0Amodule.ecs.module.pod.aws_vpc_security_group_ingress_rule.alb_icmp: Refreshing state... [id=sgr-0e10c5523b00f7c23]%0Amodule.ecs.module.pod.aws_vpc_security_group_ingress_rule.https: Refreshing state... [id=sgr-0a32d4cf4fe9ff4af]%0Amodule.keycloak.module.pod.aws_vpc_security_group_egress_rule.backend_outgoing: Refreshing state... [id=sgr-084a4b4a7956275e6]%0Amodule.keycloak.module.pod.aws_vpc_security_group_ingress_rule.backend_ssh_input: Refreshing state... [id=sgr-0ec0eed9f3d8a3ab7]%0Amodule.keycloak.module.pod.aws_vpc_security_group_ingress_rule.backend_icmp: Refreshing state... [id=sgr-0da95d368ec0bcbdb]%0Amodule.ecs.module.pod.aws_vpc_security_group_ingress_rule.backend_ssh_input: Refreshing state... [id=sgr-07a5dea5dbb291aae]%0Amodule.ecs.module.pod.aws_vpc_security_group_ingress_rule.backend_icmp: Refreshing state... [id=sgr-043d02ddfb9745980]%0Amodule.ecs.module.pod.aws_vpc_security_group_egress_rule.backend_outgoing: Refreshing state... [id=sgr-0de12114d80af02de]%0Amodule.keycloak.module.pod.aws_launch_template.website: Refreshing state... [id=lt-0d93139ab32de43aa]%0Amodule.jumphost.aws_lb_target_group.jumphost: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-1:493370826424:targetgroup/jumpho20240226175402900300000002/e819b391374f847e]%0Amodule.jumphost.aws_vpc_security_group_ingress_rule.efs: Refreshing state... [id=sgr-011e2fea66d74b99f]%0Amodule.keycloak.module.pod.aws_vpc_security_group_ingress_rule.backend_user_traffic: Refreshing state... [id=sgr-0d168218efcb7219b]%0Amodule.keycloak.module.pod.aws_vpc_security_group_ingress_rule.backend_ssh_local: Refreshing state... [id=sgr-0bbb79202dde3e83d]%0Amodule.ecs.module.pod.aws_vpc_security_group_ingress_rule.backend_user_traffic: Refreshing state... [id=sgr-06aec0ef1d95a1378]%0Amodule.ecs.module.pod.aws_vpc_security_group_ingress_rule.backend_ssh_local: Refreshing state... [id=sgr-004893c7e1cf4250f]%0Amodule.ecs.module.pod.aws_launch_template.website: Refreshing state... [id=lt-0b338e0594e73e11a]%0Amodule.jumphost.aws_route53_record.jumphost_cname: Refreshing state... [id=Z07662251LH3YRF2ERM3G_jumphost.infrahouse.com_CNAME]%0Amodule.keycloak.module.pod.aws_lb_listener.ssl: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-1:493370826424:listener/app/auth2024030222363678900000000a/a26578ce41c8310c/97b5ffe4c9e007df]%0Amodule.keycloak.module.pod.aws_alb_listener.redirect_to_ssl: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-1:493370826424:listener/app/auth2024030222363678900000000a/a26578ce41c8310c/3f453601d67d421e]%0Amodule.keycloak.module.pod.aws_route53_record.extra[0]: Refreshing state... [id=Z07662251LH3YRF2ERM3G_auth.infrahouse.com_A]%0Adata.aws_iam_policy_document.package-publisher: Reading...%0Adata.aws_iam_policy_document.package-publisher: Read complete after 0s [id=4050006037]%0Amodule.keycloak.aws_ecs_task_definition.ecs: Refreshing state... [id=auth]%0Aaws_iam_policy.package-publisher: Refreshing state... [id=arn:aws:iam::493370826424:policy/package-publisher]%0Amodule.keycloak.module.pod.aws_autoscaling_group.website: Refreshing state... [id=auth2024030222363784960000000d]%0Amodule.ecs.module.pod.aws_route53_record.extra[0]: Refreshing state... [id=Z07662251LH3YRF2ERM3G_registry.infrahouse.com_A]%0Amodule.ecs.module.pod.aws_lb_listener.ssl: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-1:493370826424:listener/app/terraf2024030219493612940000000a/1f20b225c3278266/3a119c99d9f74ead]%0Amodule.ecs.module.pod.aws_alb_listener.redirect_to_ssl: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-1:493370826424:listener/app/terraf2024030219493612940000000a/1f20b225c3278266/9c419e4a169d61e1]%0Aaws_iam_role_policy_attachment.infrahouse-toolkit-github: Refreshing state... [id=ih-tf-infrahouse-toolkit-github-20240229205019467600000001]%0Aaws_iam_role_policy_attachment.puppet-code-github: Refreshing state... [id=ih-tf-puppet-code-github-20231108132248583100000001]%0Aaws_iam_role_policy_attachment.infrahouse-puppet-data-github: Refreshing state... [id=ih-tf-infrahouse-puppet-data-github-20231108133200175400000001]%0Aaws_iam_role_policy_attachment.infrahouse-com-github: Refreshing state... [id=infrahouse-com-github-20230819214139756300000001]%0Amodule.ecs.module.pod.aws_autoscaling_group.website: Refreshing state... [id=terraf2024030219493674520000000d]%0Amodule.jumphost.aws_lb_listener.jumphost: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-1:493370826424:listener/net/jumpho20240226175403880200000003/b3fc749d99e1aea6/91aca9d503ce64cc]%0Amodule.jumphost.aws_autoscaling_group.jumphost: Refreshing state... [id=jumphost-20240223005113359100000009-02R7BZ]%0Amodule.keycloak.module.pod.aws_autoscaling_policy.cpu_load: Refreshing state... [id=auth2024030222363784960000000d]%0Amodule.keycloak.aws_ecs_capacity_provider.ecs: Refreshing state... [id=arn:aws:ecs:us-west-1:493370826424:capacity-provider/auth]%0Amodule.ecs.module.pod.aws_autoscaling_policy.cpu_load: Refreshing state... [id=terraf2024030219493674520000000d]%0Amodule.ecs.aws_ecs_capacity_provider.ecs: Refreshing state... [id=arn:aws:ecs:us-west-1:493370826424:capacity-provider/terraform-registry]%0Amodule.jumphost.data.aws_iam_policy_document.required_permissions: Reading...%0Amodule.jumphost.data.aws_iam_policy_document.required_permissions: Read complete after 0s [id=485487314]%0Amodule.jumphost.aws_iam_policy.required: Refreshing state... [id=arn:aws:iam::493370826424:policy/terraform-20240223005145929800000014]%0Amodule.keycloak.aws_ecs_cluster_capacity_providers.ecs: Refreshing state... [id=auth]%0Amodule.keycloak.aws_ecs_service.ecs: Refreshing state... [id=arn:aws:ecs:us-west-1:493370826424:service/auth/auth]%0Amodule.jumphost.module.jumphost_profile.aws_iam_role_policy_attachment.extra["required"]: Refreshing state... [id=jumphost-Zv01ElhajbB620240223005112032800000005-20240223005146325300000016]%0Amodule.jumphost.module.jumphost_profile.aws_iam_role_policy_attachment.extra["package-publisher"]: Refreshing state... [id=jumphost-Zv01ElhajbB620240223005112032800000005-20240223005146320100000015]%0Amodule.ecs.aws_ecs_cluster_capacity_providers.ecs: Refreshing state... [id=terraform-registry]%0Amodule.ecs.aws_ecs_service.ecs: Refreshing state... [id=arn:aws:ecs:us-west-1:493370826424:service/terraform-registry/terraform-registry]%0Amodule.keycloak.aws_appautoscaling_target.ecs_target: Refreshing state... [id=service/auth/auth]%0Amodule.ecs.aws_appautoscaling_target.ecs_target: Refreshing state... [id=service/terraform-registry/terraform-registry]%0Amodule.ecs.aws_appautoscaling_policy.ecs_policy: Refreshing state... [id=cpu-auto-scaling]%0Amodule.keycloak.aws_appautoscaling_policy.ecs_policy: Refreshing state... [id=cpu-auto-scaling]%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A  ~ update in-place%0A-/+ destroy and then create replacement%0A <= read (data resources)%0A%0ATerraform will perform the following actions:%0A%0A  # data.aws_iam_policy_document.registry_node_permissions will be read during apply%0A  # (config refers to values not yet known)%0A <= data "aws_iam_policy_document" "registry_node_permissions" {%0A      + id   = (known after apply)%0A      + json = (known after apply)%0A%0A      + statement {%0A          + actions   = [%0A              + "dynamodb:*",%0A            ]%0A          + resources = [%0A              + "*",%0A            ]%0A        }%0A      + statement {%0A          + actions   = [%0A              + "s3:*",%0A            ]%0A          + resources = [%0A              + (known after apply),%0A            ]%0A        }%0A      + statement {%0A          + actions   = [%0A              + "s3:*",%0A            ]%0A          + resources = [%0A              + (known after apply),%0A            ]%0A        }%0A    }%0A%0A  # aws_iam_policy.registry_node will be updated in-place%0A  ~ resource "aws_iam_policy" "registry_node" {%0A        id          = "arn:aws:iam::493370826424:policy/registry-node-20240303052126090300000001"%0A        name        = "registry-node-20240303052126090300000001"%0A      ~ policy      = jsonencode(%0A            {%0A              - Statement = [%0A                  - {%0A                      - Action   = "dynamodb:*"%0A                      - Effect   = "Allow"%0A                      - Resource = "*"%0A                    },%0A                ]%0A              - Version   = "2012-10-17"%0A            }%0A        ) -> (known after apply)%0A        tags        = {}%0A        # (5 unchanged attributes hidden)%0A    }%0A%0A  # aws_s3_bucket.terraform-registry will be created%0A  + resource "aws_s3_bucket" "terraform-registry" {%0A      + acceleration_status         = (known after apply)%0A      + acl                         = (known after apply)%0A      + arn                         = (known after apply)%0A      + bucket                      = (known after apply)%0A      + bucket_domain_name          = (known after apply)%0A      + bucket_prefix               = "infrahouse-terraform-registry-"%0A      + bucket_regional_domain_name = (known after apply)%0A      + force_destroy               = false%0A      + hosted_zone_id              = (known after apply)%0A      + id                          = (known after apply)%0A      + object_lock_enabled         = (known after apply)%0A      + policy                      = (known after apply)%0A      + region                      = (known after apply)%0A      + request_payer               = (known after apply)%0A      + tags_all                    = {%0A          + "created_by"  = "infrahouse/aws-control-493370826424"%0A          + "environment" = "production"%0A        }%0A      + website_domain              = (known after apply)%0A      + website_endpoint            = (known after apply)%0A    }%0A%0A  # module.ecs.aws_ecs_service.ecs will be updated in-place%0A  ~ resource "aws_ecs_service" "ecs" {%0A        id                                 = "arn:aws:ecs:us-west-1:493370826424:service/terraform-registry/terraform-registry"%0A        name                               = "terraform-registry"%0A        tags                               = {}%0A      ~ task_definition                    = "arn:aws:ecs:us-west-1:493370826424:task-definition/terraform-registry:8" -> (known after apply)%0A        # (13 unchanged attributes hidden)%0A%0A        # (4 unchanged blocks hidden)%0A    }%0A%0A  # module.ecs.aws_ecs_task_definition.ecs must be replaced%0A-/+ resource "aws_ecs_task_definition" "ecs" {%0A      ~ arn                      = "arn:aws:ecs:us-west-1:493370826424:task-definition/terraform-registry:8" -> (known after apply)%0A      ~ arn_without_revision     = "arn:aws:ecs:us-west-1:493370826424:task-definition/terraform-registry" -> (known after apply)%0A      ~ container_definitions    = (sensitive value) # forces replacement%0A      ~ id                       = "terraform-registry" -> (known after apply)%0A      + network_mode             = (known after apply)%0A      - requires_compatibilities = [] -> null%0A      ~ revision                 = 8 -> (known after apply)%0A      - tags                     = {} -> null%0A        # (6 unchanged attributes hidden)%0A    }%0A%0APlan: 2 to add, 2 to change, 1 to destroy.%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ASaved the plan to: tf.plan%0A%0ATo perform exactly these actions, run the following command to apply:%0A    terraform apply "tf.plan"%0A
::debug::stderr: 
::debug::exitcode: 0
```
</details>
<details>
<summary>STDERR</summary>

```no output```
</details>
<details><summary><i>metadata</i></summary>
<p>
```eyJzMzovL2luZnJhaG91c2UtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0L3RlcnJhZm9ybS50ZnN0YXRlIjogeyJzdWNjZXNzIjogdHJ1ZSwgInN0ZG91dCI6ICJUZXJyYWZvcm0gdXNlZCB0aGUgc2VsZWN0ZWQgcHJvdmlkZXJzIHRvIGdlbmVyYXRlIHRoZSBmb2xsb3dpbmcgZXhlY3V0aW9uXG5wbGFuLiBSZXNvdXJjZSBhY3Rpb25zIGFyZSBpbmRpY2F0ZWQgd2l0aCB0aGUgZm9sbG93aW5nIHN5bWJvbHM6XG4gICsgY3JlYXRlXG4gIH4gdXBkYXRlIGluLXBsYWNlXG4tLysgZGVzdHJveSBhbmQgdGhlbiBjcmVhdGUgcmVwbGFjZW1lbnRcbiA8PSByZWFkIChkYXRhIHJlc291cmNlcylcblxuVGVycmFmb3JtIHdpbGwgcGVyZm9ybSB0aGUgZm9sbG93aW5nIGFjdGlvbnM6XG5cbiAgIyBkYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnJlZ2lzdHJ5X25vZGVfcGVybWlzc2lvbnMgd2lsbCBiZSByZWFkIGR1cmluZyBhcHBseVxuICAjIChjb25maWcgcmVmZXJzIHRvIHZhbHVlcyBub3QgeWV0IGtub3duKVxuIDw9IGRhdGEgXCJhd3NfaWFtX3BvbGljeV9kb2N1bWVudFwiIFwicmVnaXN0cnlfbm9kZV9wZXJtaXNzaW9uc1wiIHtcbiAgICAgICsgaWQgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsganNvbiA9IChrbm93biBhZnRlciBhcHBseSlcblxuICAgICAgKyBzdGF0ZW1lbnQge1xuICAgICAgICAgICsgYWN0aW9ucyAgID0gW1xuICAgICAgICAgICAgICArIFwiZHluYW1vZGI6KlwiLFxuICAgICAgICAgICAgXVxuICAgICAgICAgICsgcmVzb3VyY2VzID0gW1xuICAgICAgICAgICAgICArIFwiKlwiLFxuICAgICAgICAgICAgXVxuICAgICAgICB9XG4gICAgICArIHN0YXRlbWVudCB7XG4gICAgICAgICAgKyBhY3Rpb25zICAgPSBbXG4gICAgICAgICAgICAgICsgXCJzMzoqXCIsXG4gICAgICAgICAgICBdXG4gICAgICAgICAgKyByZXNvdXJjZXMgPSBbXG4gICAgICAgICAgICAgICsgKGtub3duIGFmdGVyIGFwcGx5KSxcbiAgICAgICAgICAgIF1cbiAgICAgICAgfVxuICAgICAgKyBzdGF0ZW1lbnQge1xuICAgICAgICAgICsgYWN0aW9ucyAgID0gW1xuICAgICAgICAgICAgICArIFwiczM6KlwiLFxuICAgICAgICAgICAgXVxuICAgICAgICAgICsgcmVzb3VyY2VzID0gW1xuICAgICAgICAgICAgICArIChrbm93biBhZnRlciBhcHBseSksXG4gICAgICAgICAgICBdXG4gICAgICAgIH1cbiAgICB9XG5cbiAgIyBhd3NfaWFtX3BvbGljeS5yZWdpc3RyeV9ub2RlIHdpbGwgYmUgdXBkYXRlZCBpbi1wbGFjZVxuICB+IHJlc291cmNlIFwiYXdzX2lhbV9wb2xpY3lcIiBcInJlZ2lzdHJ5X25vZGVcIiB7XG4gICAgICAgIGlkICAgICAgICAgID0gXCJhcm46YXdzOmlhbTo6NDkzMzcwODI2NDI0OnBvbGljeS9yZWdpc3RyeS1ub2RlLTIwMjQwMzAzMDUyMTI2MDkwMzAwMDAwMDAxXCJcbiAgICAgICAgbmFtZSAgICAgICAgPSBcInJlZ2lzdHJ5LW5vZGUtMjAyNDAzMDMwNTIxMjYwOTAzMDAwMDAwMDFcIlxuICAgICAgfiBwb2xpY3kgICAgICA9IGpzb25lbmNvZGUoXG4gICAgICAgICAgICB7XG4gICAgICAgICAgICAgIC0gU3RhdGVtZW50ID0gW1xuICAgICAgICAgICAgICAgICAgLSB7XG4gICAgICAgICAgICAgICAgICAgICAgLSBBY3Rpb24gICA9IFwiZHluYW1vZGI6KlwiXG4gICAgICAgICAgICAgICAgICAgICAgLSBFZmZlY3QgICA9IFwiQWxsb3dcIlxuICAgICAgICAgICAgICAgICAgICAgIC0gUmVzb3VyY2UgPSBcIipcIlxuICAgICAgICAgICAgICAgICAgICB9LFxuICAgICAgICAgICAgICAgIF1cbiAgICAgICAgICAgICAgLSBWZXJzaW9uICAgPSBcIjIwMTItMTAtMTdcIlxuICAgICAgICAgICAgfVxuICAgICAgICApIC0+IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICAgdGFncyAgICAgICAgPSB7fVxuICAgICAgICAjICg1IHVuY2hhbmdlZCBhdHRyaWJ1dGVzIGhpZGRlbilcbiAgICB9XG5cbiAgIyBhd3NfczNfYnVja2V0LnRlcnJhZm9ybS1yZWdpc3RyeSB3aWxsIGJlIGNyZWF0ZWRcbiAgKyByZXNvdXJjZSBcImF3c19zM19idWNrZXRcIiBcInRlcnJhZm9ybS1yZWdpc3RyeVwiIHtcbiAgICAgICsgYWNjZWxlcmF0aW9uX3N0YXR1cyAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBhY2wgICAgICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGFybiAgICAgICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgYnVja2V0ICAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBidWNrZXRfZG9tYWluX25hbWUgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGJ1Y2tldF9wcmVmaXggICAgICAgICAgICAgICA9IFwiaW5mcmFob3VzZS10ZXJyYWZvcm0tcmVnaXN0cnktXCJcbiAgICAgICsgYnVja2V0X3JlZ2lvbmFsX2RvbWFpbl9uYW1lID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBmb3JjZV9kZXN0cm95ICAgICAgICAgICAgICAgPSBmYWxzZVxuICAgICAgKyBob3N0ZWRfem9uZV9pZCAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGlkICAgICAgICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgb2JqZWN0X2xvY2tfZW5hYmxlZCAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBwb2xpY3kgICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHJlZ2lvbiAgICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgcmVxdWVzdF9wYXllciAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyB0YWdzX2FsbCAgICAgICAgICAgICAgICAgICAgPSB7XG4gICAgICAgICAgKyBcImNyZWF0ZWRfYnlcIiAgPSBcImluZnJhaG91c2UvYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0XCJcbiAgICAgICAgICArIFwiZW52aXJvbm1lbnRcIiA9IFwicHJvZHVjdGlvblwiXG4gICAgICAgIH1cbiAgICAgICsgd2Vic2l0ZV9kb21haW4gICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyB3ZWJzaXRlX2VuZHBvaW50ICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgfVxuXG4gICMgbW9kdWxlLmVjcy5hd3NfZWNzX3NlcnZpY2UuZWNzIHdpbGwgYmUgdXBkYXRlZCBpbi1wbGFjZVxuICB+IHJlc291cmNlIFwiYXdzX2Vjc19zZXJ2aWNlXCIgXCJlY3NcIiB7XG4gICAgICAgIGlkICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSBcImFybjphd3M6ZWNzOnVzLXdlc3QtMTo0OTMzNzA4MjY0MjQ6c2VydmljZS90ZXJyYWZvcm0tcmVnaXN0cnkvdGVycmFmb3JtLXJlZ2lzdHJ5XCJcbiAgICAgICAgbmFtZSAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICA9IFwidGVycmFmb3JtLXJlZ2lzdHJ5XCJcbiAgICAgICAgdGFncyAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICA9IHt9XG4gICAgICB+IHRhc2tfZGVmaW5pdGlvbiAgICAgICAgICAgICAgICAgICAgPSBcImFybjphd3M6ZWNzOnVzLXdlc3QtMTo0OTMzNzA4MjY0MjQ6dGFzay1kZWZpbml0aW9uL3RlcnJhZm9ybS1yZWdpc3RyeTo4XCIgLT4gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgICAjICgxMyB1bmNoYW5nZWQgYXR0cmlidXRlcyBoaWRkZW4pXG5cbiAgICAgICAgIyAoNCB1bmNoYW5nZWQgYmxvY2tzIGhpZGRlbilcbiAgICB9XG5cbiAgIyBtb2R1bGUuZWNzLmF3c19lY3NfdGFza19kZWZpbml0aW9uLmVjcyBtdXN0IGJlIHJlcGxhY2VkXG4tLysgcmVzb3VyY2UgXCJhd3NfZWNzX3Rhc2tfZGVmaW5pdGlvblwiIFwiZWNzXCIge1xuICAgICAgfiBhcm4gICAgICAgICAgICAgICAgICAgICAgPSBcImFybjphd3M6ZWNzOnVzLXdlc3QtMTo0OTMzNzA4MjY0MjQ6dGFzay1kZWZpbml0aW9uL3RlcnJhZm9ybS1yZWdpc3RyeTo4XCIgLT4gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgfiBhcm5fd2l0aG91dF9yZXZpc2lvbiAgICAgPSBcImFybjphd3M6ZWNzOnVzLXdlc3QtMTo0OTMzNzA4MjY0MjQ6dGFzay1kZWZpbml0aW9uL3RlcnJhZm9ybS1yZWdpc3RyeVwiIC0+IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgIH4gY29udGFpbmVyX2RlZmluaXRpb25zICAgID0gKHNlbnNpdGl2ZSB2YWx1ZSkgIyBmb3JjZXMgcmVwbGFjZW1lbnRcbiAgICAgIH4gaWQgICAgICAgICAgICAgICAgICAgICAgID0gXCJ0ZXJyYWZvcm0tcmVnaXN0cnlcIiAtPiAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIG5ldHdvcmtfbW9kZSAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgIC0gcmVxdWlyZXNfY29tcGF0aWJpbGl0aWVzID0gW10gLT4gbnVsbFxuICAgICAgfiByZXZpc2lvbiAgICAgICAgICAgICAgICAgPSA4IC0+IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgIC0gdGFncyAgICAgICAgICAgICAgICAgICAgID0ge30gLT4gbnVsbFxuICAgICAgICAjICg2IHVuY2hhbmdlZCBhdHRyaWJ1dGVzIGhpZGRlbilcbiAgICB9XG5cblBsYW46IDIgdG8gYWRkLCAyIHRvIGNoYW5nZSwgMSB0byBkZXN0cm95LlxuXG5cdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcblxuU2F2ZWQgdGhlIHBsYW4gdG86IHRmLnBsYW5cblxuVG8gcGVyZm9ybSBleGFjdGx5IHRoZXNlIGFjdGlvbnMsIHJ1biB0aGUgZm9sbG93aW5nIGNvbW1hbmQgdG8gYXBwbHk6XG4gICAgdGVycmFmb3JtIGFwcGx5IFwidGYucGxhblwiXG46OmRlYnVnOjpUZXJyYWZvcm0gZXhpdGVkIHdpdGggY29kZSAwLlxuOjpkZWJ1Zzo6c3Rkb3V0OiBkYXRhLnRlcnJhZm9ybV9yZW1vdGVfc3RhdGUuY2ljZDogUmVhZGluZy4uLiUwQW1vZHVsZS5lY3MuZGF0YS5jbG91ZGluaXRfY29uZmlnLmVjczogUmVhZGluZy4uLiUwQW1vZHVsZS5rZXljbG9hay5kYXRhLmNsb3VkaW5pdF9jb25maWcuZWNzOiBSZWFkaW5nLi4uJTBBbW9kdWxlLmVjcy5kYXRhLmNsb3VkaW5pdF9jb25maWcuZWNzOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD00MjE3NzIwMzc5XSUwQW1vZHVsZS5rZXljbG9hay5kYXRhLmNsb3VkaW5pdF9jb25maWcuZWNzOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0xNDY2NzU3NTE3XSUwQW1vZHVsZS5qdW1waG9zdC5yYW5kb21fc3RyaW5nLmFzZ19uYW1lOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD0wMlI3QlpdJTBBbW9kdWxlLmp1bXBob3N0LnJhbmRvbV9zdHJpbmcucHJvZmlsZS1zdWZmaXg6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPVp2MDFFbGhhamJCNl0lMEFyYW5kb21fcGFzc3dvcmQua2V5Y2xvYWtfYWRtaW5fcGFzc3dvcmQ6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPW5vbmVdJTBBcmFuZG9tX3Bhc3N3b3JkLmtleWNsb2FrX3NlcnZpY2U6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPW5vbmVdJTBBcmFuZG9tX3BldC5rZXljbG9ha19hZG1pbl91c2VybmFtZTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YWNjZXB0ZWQtYXNwXSUwQW1vZHVsZS5yZWxlYXNlX2luZnJhaG91c2VfY29tW1wiamFtbXlcIl0ucmFuZG9tX3Bhc3N3b3JkLnBhc3NwaHJhc2U6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPW5vbmVdJTBBbW9kdWxlLnJlbGVhc2VfaW5mcmFob3VzZV9jb21bXCJmb2NhbFwiXS5yYW5kb21fcGFzc3dvcmQucGFzc3BocmFzZTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9bm9uZV0lMEFtb2R1bGUucmVsZWFzZV9pbmZyYWhvdXNlX2NvbVtcImZvY2FsXCJdLmF3c19hY21fY2VydGlmaWNhdGUucmVwbzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czphY206dXMtZWFzdC0xOjQ5MzM3MDgyNjQyNDpjZXJ0aWZpY2F0ZS8yZWVkNTNkMy1lMWFkLTQ3NDMtYWNlNS04OWMxOTNjZDNjNjVdJTBBbW9kdWxlLnJlbGVhc2VfaW5mcmFob3VzZV9jb21bXCJqYW1teVwiXS5hd3NfYWNtX2NlcnRpZmljYXRlLnJlcG86IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6YWNtOnVzLWVhc3QtMTo0OTMzNzA4MjY0MjQ6Y2VydGlmaWNhdGUvNDAyODUyZTEtNzA1NC00Y2VhLTgwYWMtM2NjYmVlNzJhMzk4XSUwQWRhdGEuYXdzX3JlZ2lvbi5jdXJyZW50OiBSZWFkaW5nLi4uJTBBYXdzX3NlY3JldHNtYW5hZ2VyX3NlY3JldC5rZXljbG9ha19zZXJ2aWNlOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hcm46YXdzOnNlY3JldHNtYW5hZ2VyOnVzLXdlc3QtMTo0OTMzNzA4MjY0MjQ6c2VjcmV0OmtleWNsb2FrX3NlcnZpY2UyMDI0MDMwMzE3NDg1NjgwODkwMDAwMDAwMi1LNlp3ZENdJTBBZGF0YS5hd3NfY2FsbGVyX2lkZW50aXR5LmN1cnJlbnQ6IFJlYWRpbmcuLi4lMEFkYXRhLmF3c19yZWdpb24uY3VycmVudDogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9dXMtd2VzdC0xXSUwQW1vZHVsZS5rZXljbG9hay5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmFzc3VtZV9yb2xlX3BvbGljeTogUmVhZGluZy4uLiUwQW1vZHVsZS5yZWxlYXNlX2luZnJhaG91c2VfY29tW1wiZm9jYWxcIl0uYXdzX3NlY3JldHNtYW5hZ2VyX3NlY3JldC5rZXk6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6c2VjcmV0c21hbmFnZXI6dXMtd2VzdC0xOjQ5MzM3MDgyNjQyNDpzZWNyZXQ6cGFja2FnZXIta2V5LWZvY2FsLVhyVFdyUF0lMEFtb2R1bGUucmVsZWFzZV9pbmZyYWhvdXNlX2NvbVtcImphbW15XCJdLmF3c19zZWNyZXRzbWFuYWdlcl9zZWNyZXQua2V5OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hcm46YXdzOnNlY3JldHNtYW5hZ2VyOnVzLXdlc3QtMTo0OTMzNzA4MjY0MjQ6c2VjcmV0OnBhY2thZ2VyLWtleS1qYW1teS1YclRXclBdJTBBbW9kdWxlLmp1bXBob3N0LmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuanVtcGhvc3RfcGVybWlzc2lvbnM6IFJlYWRpbmcuLi4lMEFkYXRhLmF3c19pYW1fcG9saWN5LmFkbWluaXN0cmF0b3ItYWNjZXNzOiBSZWFkaW5nLi4uJTBBbW9kdWxlLnJlbGVhc2VfaW5mcmFob3VzZV9jb21bXCJmb2NhbFwiXS5hd3NfY2xvdWRmcm9udF9jYWNoZV9wb2xpY3kuZGVmYXVsdDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9NWRiNDk0ZGQtNTQ2Yi00MjMxLWEwYzctMTMzYjI0NWFkYTQ5XSUwQW1vZHVsZS5yZWxlYXNlX2luZnJhaG91c2VfY29tW1wiamFtbXlcIl0uYXdzX2Nsb3VkZnJvbnRfY2FjaGVfcG9saWN5LmRlZmF1bHQ6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWIwNGFmZjQ1LTQ4ZTEtNDUwMS05MGQzLTk5OGM5ZmExZjI2NF0lMEFtb2R1bGUua2V5Y2xvYWsuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5hc3N1bWVfcm9sZV9wb2xpY3k6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTEwNzc4MDQ0NzVdJTBBbW9kdWxlLmp1bXBob3N0LmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuanVtcGhvc3RfcGVybWlzc2lvbnM6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTIyMTgzMTU0MDJdJTBBbW9kdWxlLmp1bXBob3N0Lm1vZHVsZS5qdW1waG9zdF91c2VyZGF0YS5kYXRhLmF3c19yZWdpb24uY3VycmVudDogUmVhZGluZy4uLiUwQW1vZHVsZS5qdW1waG9zdC5kYXRhLmF3c19jYWxsZXJfaWRlbnRpdHkuY3VycmVudDogUmVhZGluZy4uLiUwQW1vZHVsZS5qdW1waG9zdC5tb2R1bGUuanVtcGhvc3RfdXNlcmRhdGEuZGF0YS5hd3NfcmVnaW9uLmN1cnJlbnQ6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPXVzLXdlc3QtMV0lMEFtb2R1bGUuZWNzLmF3c19lY3NfY2x1c3Rlci5lY3M6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6ZWNzOnVzLXdlc3QtMTo0OTMzNzA4MjY0MjQ6Y2x1c3Rlci90ZXJyYWZvcm0tcmVnaXN0cnldJTBBZGF0YS5hd3NfY2FsbGVyX2lkZW50aXR5LmN1cnJlbnQ6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTQ5MzM3MDgyNjQyNF0lMEFtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0LWFkbWluLmRhdGEuYXdzX2lhbV9wb2xpY3kuYWRtaW46IFJlYWRpbmcuLi4lMEFtb2R1bGUuanVtcGhvc3QuZGF0YS5hd3NfY2FsbGVyX2lkZW50aXR5LmN1cnJlbnQ6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTQ5MzM3MDgyNjQyNF0lMEFhd3NfaWFtX3BvbGljeS5yZWdpc3RyeV9ub2RlOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hcm46YXdzOmlhbTo6NDkzMzcwODI2NDI0OnBvbGljeS9yZWdpc3RyeS1ub2RlLTIwMjQwMzAzMDUyMTI2MDkwMzAwMDAwMDAxXSUwQW1vZHVsZS5lY3MubW9kdWxlLnBvZC5tb2R1bGUud2Vic2VydmVyX3Byb2ZpbGUuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5hc3N1bWU6IFJlYWRpbmcuLi4lMEFtb2R1bGUuZWNzLm1vZHVsZS5wb2QubW9kdWxlLndlYnNlcnZlcl9wcm9maWxlLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuYXNzdW1lOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0yODUxMTE5NDI3XSUwQW1vZHVsZS5wdXBwZXQtY29kZS1naXRodWIuZGF0YS5hd3NfaWFtX29wZW5pZF9jb25uZWN0X3Byb3ZpZGVyLmdpdGh1YjogUmVhZGluZy4uLiUwQW1vZHVsZS5rZXljbG9hay5tb2R1bGUucG9kLm1vZHVsZS53ZWJzZXJ2ZXJfcHJvZmlsZS5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmFzc3VtZTogUmVhZGluZy4uLiUwQW1vZHVsZS5rZXljbG9hay5tb2R1bGUucG9kLm1vZHVsZS53ZWJzZXJ2ZXJfcHJvZmlsZS5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmFzc3VtZTogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9Mjg1MTExOTQyN10lMEFkYXRhLmF3c19hbWkudWJ1bnR1XzIyOiBSZWFkaW5nLi4uJTBBbW9kdWxlLmVjcy5kYXRhLmF3c19hbWkuZWNzOiBSZWFkaW5nLi4uJTBBbW9kdWxlLnB1cHBldC1jb2RlLWdpdGh1Yi5kYXRhLmF3c19pYW1fb3BlbmlkX2Nvbm5lY3RfcHJvdmlkZXIuZ2l0aHViOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDFzIFtpZD1hcm46YXdzOmlhbTo6NDkzMzcwODI2NDI0Om9pZGMtcHJvdmlkZXIvdG9rZW4uYWN0aW9ucy5naXRodWJ1c2VyY29udGVudC5jb21dJTBBbW9kdWxlLmtleWNsb2FrLmF3c19lY3NfY2x1c3Rlci5lY3M6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6ZWNzOnVzLXdlc3QtMTo0OTMzNzA4MjY0MjQ6Y2x1c3Rlci9hdXRoXSUwQW1vZHVsZS5lY3MuZGF0YS5hd3NfY2FsbGVyX2lkZW50aXR5LmN1cnJlbnQ6IFJlYWRpbmcuLi4lMEFtb2R1bGUuanVtcGhvc3QubW9kdWxlLmp1bXBob3N0X3Byb2ZpbGUuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5hc3N1bWU6IFJlYWRpbmcuLi4lMEFtb2R1bGUuanVtcGhvc3QubW9kdWxlLmp1bXBob3N0X3Byb2ZpbGUuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5hc3N1bWU6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTI4NTExMTk0MjddJTBBbW9kdWxlLmtleWNsb2FrLmRhdGEuYXdzX2lhbV9wb2xpY3kuZWNzLXRhc2stZXhlY3V0aW9uLXJvbGUtcG9saWN5OiBSZWFkaW5nLi4uJTBBbW9kdWxlLmtleWNsb2FrLm1vZHVsZS5wb2QuZGF0YS5hd3NfY2FsbGVyX2lkZW50aXR5LmN1cnJlbnQ6IFJlYWRpbmcuLi4lMEFtb2R1bGUuaW5mcmFob3VzZS10b29sa2l0LWdpdGh1Yi5kYXRhLmF3c19pYW1fb3BlbmlkX2Nvbm5lY3RfcHJvdmlkZXIuZ2l0aHViOiBSZWFkaW5nLi4uJTBBbW9kdWxlLmVjcy5kYXRhLmF3c19jYWxsZXJfaWRlbnRpdHkuY3VycmVudDogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9NDkzMzcwODI2NDI0XSUwQW1vZHVsZS5paC10Zi1pbmZyYWhvdXNlLXdlYnNpdGUtaW5mcmEtYWRtaW4uZGF0YS5hd3NfaWFtX3BvbGljeS5hZG1pbjogUmVhZGluZy4uLiUwQW1vZHVsZS5pbmZyYWhvdXNlLXRvb2xraXQtZ2l0aHViLmRhdGEuYXdzX2lhbV9vcGVuaWRfY29ubmVjdF9wcm92aWRlci5naXRodWI6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPWFybjphd3M6aWFtOjo0OTMzNzA4MjY0MjQ6b2lkYy1wcm92aWRlci90b2tlbi5hY3Rpb25zLmdpdGh1YnVzZXJjb250ZW50LmNvbV0lMEFtb2R1bGUubWFuYWdlbWVudC5hd3NfdnBjLnZwYzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9dnBjLTA4ZTE5ZDg1OWMyNmQxOGIyXSUwQW1vZHVsZS5rZXljbG9hay5tb2R1bGUucG9kLmRhdGEuYXdzX2NhbGxlcl9pZGVudGl0eS5jdXJyZW50OiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD00OTMzNzA4MjY0MjRdJTBBbW9kdWxlLmtleWNsb2FrLmRhdGEuYXdzX2FtaS5lY3M6IFJlYWRpbmcuLi4lMEFhd3Nfc2VjcmV0c21hbmFnZXJfc2VjcmV0LmtleWNsb2FrX2FkbWluX2NyZWRzOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hcm46YXdzOnNlY3JldHNtYW5hZ2VyOnVzLXdlc3QtMTo0OTMzNzA4MjY0MjQ6c2VjcmV0OmtleWNsb2FrX2FkbWluX2NyZWRlbnRpYWxzMjAyNDAzMDIyMjQzNTIxNDI1MDAwMDAwMDEtcWtmY3hkXSUwQWRhdGEuYXdzX2FtaS51YnVudHVfMjI6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMXMgW2lkPWFtaS0wNWM5NjkzNjk4ODBmYTJjMl0lMEFtb2R1bGUuaWgtdGYtaW5mcmFob3VzZS13ZWJzaXRlLWluZnJhLWFkbWluLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuZ2l0aHViLXBlcm1pc3Npb25zOiBSZWFkaW5nLi4uJTBBbW9kdWxlLmloLXRmLWluZnJhaG91c2Utd2Vic2l0ZS1pbmZyYS1hZG1pbi5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmdpdGh1Yi1wZXJtaXNzaW9uczogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9MTU4NTM0NjgzMl0lMEFhd3Nfa2V5X3BhaXIuYWxla3M6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFsZWtzXSUwQW1vZHVsZS5lY3MubW9kdWxlLnBvZC5kYXRhLmF3c19jYWxsZXJfaWRlbnRpdHkuY3VycmVudDogUmVhZGluZy4uLiUwQW1vZHVsZS5lY3MuZGF0YS5hd3NfYW1pLmVjczogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9YW1pLTBjNTM1ZTI0YWJiZjEyNzM4XSUwQW1vZHVsZS5rZXljbG9hay5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50Lmluc3RhbmNlX3BvbGljeTogUmVhZGluZy4uLiUwQW1vZHVsZS5rZXljbG9hay5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50Lmluc3RhbmNlX3BvbGljeTogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9MTU1MjkxODg5OV0lMEFtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0LWFkbWluLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuZ2l0aHViLXBlcm1pc3Npb25zOiBSZWFkaW5nLi4uJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNC1hZG1pbi5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmdpdGh1Yi1wZXJtaXNzaW9uczogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9ODM3MzE5MDRdJTBBbW9kdWxlLmVjcy5kYXRhLmF3c19pYW1fcG9saWN5LmVjcy10YXNrLWV4ZWN1dGlvbi1yb2xlLXBvbGljeTogUmVhZGluZy4uLiUwQW1vZHVsZS5lY3MubW9kdWxlLnBvZC5kYXRhLmF3c19jYWxsZXJfaWRlbnRpdHkuY3VycmVudDogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9NDkzMzcwODI2NDI0XSUwQW1vZHVsZS5rZXljbG9hay5kYXRhLmF3c19jYWxsZXJfaWRlbnRpdHkuY3VycmVudDogUmVhZGluZy4uLiUwQWRhdGEudGVycmFmb3JtX3JlbW90ZV9zdGF0ZS5jaWNkOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDFzJTBBbW9kdWxlLmluZnJhaG91c2VfY29tLmF3c19yb3V0ZTUzX3pvbmUuaW5mcmFob3VzZV9jb206IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPVowNzY2MjI1MUxIM1lSRjJFUk0zR10lMEFkYXRhLmF3c19pYW1fcG9saWN5LmFkbWluaXN0cmF0b3ItYWNjZXNzOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDFzIFtpZD1hcm46YXdzOmlhbTo6YXdzOnBvbGljeS9BZG1pbmlzdHJhdG9yQWNjZXNzXSUwQW1vZHVsZS5qdW1waG9zdC5kYXRhLmF3c19hbWkudWJ1bnR1OiBSZWFkaW5nLi4uJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNC1hZG1pbi5kYXRhLmF3c19pYW1fcG9saWN5LmFkbWluOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDFzIFtpZD1hcm46YXdzOmlhbTo6YXdzOnBvbGljeS9BZG1pbmlzdHJhdG9yQWNjZXNzXSUwQWF3c19rZXlfcGFpci5hbGVrcy1CbGFjay1NQlA6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFsZWtzLUJsYWNrLU1CUF0lMEFtb2R1bGUua2V5Y2xvYWsuZGF0YS5hd3NfY2FsbGVyX2lkZW50aXR5LmN1cnJlbnQ6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTQ5MzM3MDgyNjQyNF0lMEFtb2R1bGUuZWNzLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuaW5zdGFuY2VfcG9saWN5OiBSZWFkaW5nLi4uJTBBbW9kdWxlLmVjcy5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50Lmluc3RhbmNlX3BvbGljeTogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9MTU1MjkxODg5OV0lMEFtb2R1bGUuanVtcGhvc3QuYXdzX2Vmc19maWxlX3N5c3RlbS5ob21lOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1mcy0wY2JkMzc0OTU0OGQwNGRhNl0lMEFtb2R1bGUuZWNzLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuYXNzdW1lX3JvbGVfcG9saWN5OiBSZWFkaW5nLi4uJTBBbW9kdWxlLmVjcy5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmFzc3VtZV9yb2xlX3BvbGljeTogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9MTA3NzgwNDQ3NV0lMEFtb2R1bGUua2V5Y2xvYWsuZGF0YS5hd3NfcmVnaW9uLmN1cnJlbnQ6IFJlYWRpbmcuLi4lMEFtb2R1bGUua2V5Y2xvYWsuZGF0YS5hd3NfcmVnaW9uLmN1cnJlbnQ6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPXVzLXdlc3QtMV0lMEFtb2R1bGUucmVsZWFzZV9pbmZyYWhvdXNlX2NvbVtcImphbW15XCJdLmF3c19jbG91ZGZyb250X29yaWdpbl9hY2Nlc3NfY29udHJvbC5yZXBvLXN0b3JhZ2U6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPUUxOUpVT001V0w5UjNRXSUwQW1vZHVsZS5rZXljbG9hay5kYXRhLmF3c19hbWkuZWNzOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD1hbWktMGM1MzVlMjRhYmJmMTI3MzhdJTBBYXdzX3NlY3JldHNtYW5hZ2VyX3NlY3JldC5yZWdpc3RyeV9jbGllbnRfc2VjcmV0OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hcm46YXdzOnNlY3JldHNtYW5hZ2VyOnVzLXdlc3QtMTo0OTMzNzA4MjY0MjQ6c2VjcmV0OnJlZ2lzdHJ5X2NsaWVudF9zZWNyZXQyMDI0MDMwMjIwMzcwODA1MTAwMDAwMDAwMS1VQTR6UkVdJTBBbW9kdWxlLnJlbGVhc2VfaW5mcmFob3VzZV9jb21bXCJmb2NhbFwiXS5hd3NfY2xvdWRmcm9udF9vcmlnaW5fYWNjZXNzX2NvbnRyb2wucmVwby1zdG9yYWdlOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1FTVk0WVJRQlk5QTY0XSUwQW1vZHVsZS5yZWxlYXNlX2luZnJhaG91c2VfY29tW1wiamFtbXlcIl0uYXdzX2Nsb3VkZnJvbnRfZnVuY3Rpb24uaHR0cF9hdXRoOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1yZWxlYXNlLWphbW15X2luZnJhaG91c2VfY29tLWF1dGhdJTBBbW9kdWxlLnJlbGVhc2VfaW5mcmFob3VzZV9jb21bXCJmb2NhbFwiXS5hd3NfY2xvdWRmcm9udF9mdW5jdGlvbi5odHRwX2F1dGg6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXJlbGVhc2UtZm9jYWxfaW5mcmFob3VzZV9jb20tYXV0aF0lMEFtb2R1bGUuZWNzLmRhdGEuYXdzX3JlZ2lvbi5jdXJyZW50OiBSZWFkaW5nLi4uJTBBbW9kdWxlLmVjcy5kYXRhLmF3c19yZWdpb24uY3VycmVudDogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9dXMtd2VzdC0xXSUwQWRhdGEuYXdzX2F2YWlsYWJpbGl0eV96b25lcy51dzE6IFJlYWRpbmcuLi4lMEFtb2R1bGUuaW5mcmFob3VzZS1wdXBwZXQtZGF0YS1naXRodWIuZGF0YS5hd3NfaWFtX29wZW5pZF9jb25uZWN0X3Byb3ZpZGVyLmdpdGh1YjogUmVhZGluZy4uLiUwQW1vZHVsZS5qdW1waG9zdC5kYXRhLmF3c19hbWkudWJ1bnR1OiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD1hbWktMDVjOTY5MzY5ODgwZmEyYzJdJTBBbW9kdWxlLmdpdGh1Yi1jb25uZWN0b3IuYXdzX2lhbV9vcGVuaWRfY29ubmVjdF9wcm92aWRlci5naXRodWI6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6aWFtOjo0OTMzNzA4MjY0MjQ6b2lkYy1wcm92aWRlci90b2tlbi5hY3Rpb25zLmdpdGh1YnVzZXJjb250ZW50LmNvbV0lMEFkYXRhLmF3c19hdmFpbGFiaWxpdHlfem9uZXMudXcxOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD11cy13ZXN0LTFdJTBBbW9kdWxlLnJlbGVhc2VfaW5mcmFob3VzZV9jb21bXCJqYW1teVwiXS5hd3NfczNfYnVja2V0LnJlcG86IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtcmVsZWFzZS1qYW1teV0lMEFtb2R1bGUucmVsZWFzZV9pbmZyYWhvdXNlX2NvbVtcImZvY2FsXCJdLmF3c19zM19idWNrZXQucmVwbzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1yZWxlYXNlLWZvY2FsXSUwQW1vZHVsZS5rZXljbG9hay5kYXRhLmF3c19pYW1fcG9saWN5LmVjcy10YXNrLWV4ZWN1dGlvbi1yb2xlLXBvbGljeTogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9YXJuOmF3czppYW06OmF3czpwb2xpY3kvc2VydmljZS1yb2xlL0FtYXpvbkVDU1Rhc2tFeGVjdXRpb25Sb2xlUG9saWN5XSUwQW1vZHVsZS5qdW1waG9zdC5kYXRhLmF3c19yZWdpb24uY3VycmVudDogUmVhZGluZy4uLiUwQW1vZHVsZS5pbmZyYWhvdXNlLXB1cHBldC1kYXRhLWdpdGh1Yi5kYXRhLmF3c19pYW1fb3BlbmlkX2Nvbm5lY3RfcHJvdmlkZXIuZ2l0aHViOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD1hcm46YXdzOmlhbTo6NDkzMzcwODI2NDI0Om9pZGMtcHJvdmlkZXIvdG9rZW4uYWN0aW9ucy5naXRodWJ1c2VyY29udGVudC5jb21dJTBBbW9kdWxlLmp1bXBob3N0LmRhdGEuYXdzX3JlZ2lvbi5jdXJyZW50OiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD11cy13ZXN0LTFdJTBBbW9kdWxlLnJlbGVhc2VfaW5mcmFob3VzZV9jb21bXCJmb2NhbFwiXS5hd3Nfc2VjcmV0c21hbmFnZXJfc2VjcmV0LnBhc3NwaHJhc2U6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6c2VjcmV0c21hbmFnZXI6dXMtd2VzdC0xOjQ5MzM3MDgyNjQyNDpzZWNyZXQ6cGFja2FnZXItcGFzc3BocmFzZS1mb2NhbC1nenhRUHFdJTBBbW9kdWxlLnJlbGVhc2VfaW5mcmFob3VzZV9jb21bXCJmb2NhbFwiXS5hd3NfczNfYnVja2V0LnJlcG8tbG9nczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1yZWxlYXNlLWZvY2FsLWxvZ3NdJTBBbW9kdWxlLmloLXRmLWluZnJhaG91c2Utd2Vic2l0ZS1pbmZyYS1hZG1pbi5kYXRhLmF3c19pYW1fcG9saWN5LmFkbWluOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD1hcm46YXdzOmlhbTo6YXdzOnBvbGljeS9BZG1pbmlzdHJhdG9yQWNjZXNzXSUwQW1vZHVsZS5yZWxlYXNlX2luZnJhaG91c2VfY29tW1wiamFtbXlcIl0uYXdzX3NlY3JldHNtYW5hZ2VyX3NlY3JldC5wYXNzcGhyYXNlOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hcm46YXdzOnNlY3JldHNtYW5hZ2VyOnVzLXdlc3QtMTo0OTMzNzA4MjY0MjQ6c2VjcmV0OnBhY2thZ2VyLXBhc3NwaHJhc2UtamFtbXkteGE2UFRHXSUwQW1vZHVsZS5yZWxlYXNlX2luZnJhaG91c2VfY29tW1wiamFtbXlcIl0uYXdzX3MzX2J1Y2tldC5yZXBvLWxvZ3M6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtcmVsZWFzZS1qYW1teS1sb2dzXSUwQW1vZHVsZS5rZXljbG9hay5hd3NfaWFtX3JvbGUuZWNzX3Rhc2tfZXhlY3V0aW9uX3JvbGU6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWF1dGhUYXNrRXhlY3V0aW9uUm9sZV0lMEFkYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnJlZ2lzdHJ5X25vZGVfYXNzdW1lOiBSZWFkaW5nLi4uJTBBZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5yZWdpc3RyeV9ub2RlX2Fzc3VtZTogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9MzcxOTQ0OTc4Ml0lMEFtb2R1bGUuZWNzLm1vZHVsZS5wb2QubW9kdWxlLndlYnNlcnZlcl9wcm9maWxlLmF3c19pYW1fcm9sZS5wcm9maWxlOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD10ZXJyYWZvcm0tcmVnaXN0cnlfaW5zdGFuY2UyMDI0MDMwMjE5NDkzNTA2OTgwMDAwMDAwN10lMEFtb2R1bGUua2V5Y2xvYWsubW9kdWxlLnBvZC5tb2R1bGUud2Vic2VydmVyX3Byb2ZpbGUuYXdzX2lhbV9yb2xlLnByb2ZpbGU6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWF1dGhfaW5zdGFuY2UyMDI0MDMwMjIyMzYzNDg1MjAwMDAwMDAwMV0lMEFtb2R1bGUucHVwcGV0LWNvZGUtZ2l0aHViLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuZ2l0aHViLXRydXN0OiBSZWFkaW5nLi4uJTBBbW9kdWxlLnB1cHBldC1jb2RlLWdpdGh1Yi5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmdpdGh1Yi10cnVzdDogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9MjQyMzUyMDc5M10lMEFhd3Nfc2VjcmV0c21hbmFnZXJfc2VjcmV0X3ZlcnNpb24ua2V5Y2xvYWtfc2VydmljZTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czpzZWNyZXRzbWFuYWdlcjp1cy13ZXN0LTE6NDkzMzcwODI2NDI0OnNlY3JldDprZXljbG9ha19zZXJ2aWNlMjAyNDAzMDMxNzQ4NTY4MDg5MDAwMDAwMDItSzZad2RDfHRlcnJhZm9ybS0yMDI0MDMwMzE3NDg1NzA3MzUwMDAwMDAwNV0lMEFtb2R1bGUuZWNzLmRhdGEuYXdzX2lhbV9wb2xpY3kuZWNzLXRhc2stZXhlY3V0aW9uLXJvbGUtcG9saWN5OiBSZWFkIGNvbXBsZXRlIGFmdGVyIDFzIFtpZD1hcm46YXdzOmlhbTo6YXdzOnBvbGljeS9zZXJ2aWNlLXJvbGUvQW1hem9uRUNTVGFza0V4ZWN1dGlvblJvbGVQb2xpY3ldJTBBbW9kdWxlLmp1bXBob3N0Lm1vZHVsZS5qdW1waG9zdF9wcm9maWxlLmF3c19pYW1fcm9sZS5wcm9maWxlOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1qdW1waG9zdC1adjAxRWxoYWpiQjYyMDI0MDIyMzAwNTExMjAzMjgwMDAwMDAwNV0lMEFtb2R1bGUuaW5mcmFob3VzZS10b29sa2l0LWdpdGh1Yi5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmdpdGh1Yi10cnVzdDogUmVhZGluZy4uLiUwQW1vZHVsZS5pbmZyYWhvdXNlLXRvb2xraXQtZ2l0aHViLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuZ2l0aHViLXRydXN0OiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD00MTA3OTE5MDkxXSUwQW1vZHVsZS5paC10Zi1pbmZyYWhvdXNlLXdlYnNpdGUtaW5mcmEtYWRtaW4uYXdzX2lhbV9wb2xpY3kuZ2l0aHViOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hcm46YXdzOmlhbTo6NDkzMzcwODI2NDI0OnBvbGljeS9paC10Zi1pbmZyYWhvdXNlLXdlYnNpdGUtaW5mcmEtZ2l0aHViXSUwQWF3c19zZWNyZXRzbWFuYWdlcl9zZWNyZXRfdmVyc2lvbi5rZXljbG9ha19hZG1pbl9jcmVkczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czpzZWNyZXRzbWFuYWdlcjp1cy13ZXN0LTE6NDkzMzcwODI2NDI0OnNlY3JldDprZXljbG9ha19hZG1pbl9jcmVkZW50aWFsczIwMjQwMzAyMjI0MzUyMTQyNTAwMDAwMDAxLXFrZmN4ZHx0ZXJyYWZvcm0tMjAyNDAzMDIyMjQzNTI3MjMzMDAwMDAwMDNdJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNC1hZG1pbi5hd3NfaWFtX3BvbGljeS5naXRodWI6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6aWFtOjo0OTMzNzA4MjY0MjQ6cG9saWN5L2loLXRmLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNC1naXRodWJdJTBBZGF0YS5hd3Nfcm91dGU1M196b25lLmNpY2QtaWgtY29tOiBSZWFkaW5nLi4uJTBBbW9kdWxlLmVjcy5hd3NfaWFtX3JvbGUuZWNzX3Rhc2tfZXhlY3V0aW9uX3JvbGU6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXRlcnJhZm9ybS1yZWdpc3RyeVRhc2tFeGVjdXRpb25Sb2xlXSUwQW1vZHVsZS5pbmZyYWhvdXNlX2NvbS5hd3Nfcm91dGU1M19yZWNvcmQubXg6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPVowNzY2MjI1MUxIM1lSRjJFUk0zR19pbmZyYWhvdXNlLmNvbV9NWF0lMEFtb2R1bGUuaW5mcmFob3VzZV9jb20uYXdzX3JvdXRlNTNfcmVjb3JkLnNwZjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9WjA3NjYyMjUxTEgzWVJGMkVSTTNHX2luZnJhaG91c2UuY29tX1NQRl0lMEFtb2R1bGUuaW5mcmFob3VzZV9jb20uYXdzX3JvdXRlNTNfcmVjb3JkLnR4dF9zcGY6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPVowNzY2MjI1MUxIM1lSRjJFUk0zR19pbmZyYWhvdXNlLmNvbV9UWFRdJTBBbW9kdWxlLmluZnJhaG91c2VfY29tLmF3c19yb3V0ZTUzX3JlY29yZC50eHRfZGtpbTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9WjA3NjYyMjUxTEgzWVJGMkVSTTNHX2dvb2dsZS5fZG9tYWlua2V5LmluZnJhaG91c2UuY29tX1RYVF0lMEFkYXRhLmF3c19zZWNyZXRzbWFuYWdlcl9zZWNyZXRfdmVyc2lvbi5yZWdpc3RyeV9jbGllbnRfc2VjcmV0OiBSZWFkaW5nLi4uJTBBbW9kdWxlLmluZnJhaG91c2UtcHVwcGV0LWRhdGEtZ2l0aHViLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuZ2l0aHViLXRydXN0OiBSZWFkaW5nLi4uJTBBbW9kdWxlLmluZnJhaG91c2UtcHVwcGV0LWRhdGEtZ2l0aHViLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuZ2l0aHViLXRydXN0OiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0yOTAzNTEzODBdJTBBbW9kdWxlLmp1bXBob3N0Lm1vZHVsZS5qdW1waG9zdF9wcm9maWxlLmF3c19pYW1fcG9saWN5LnByb2ZpbGU6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6aWFtOjo0OTMzNzA4MjY0MjQ6cG9saWN5L2p1bXBob3N0LVp2MDFFbGhhamJCNjIwMjQwMjIzMDA1MTEyMDIyODAwMDAwMDAyXSUwQWRhdGEuYXdzX3JvdXRlNTNfem9uZS5jaWNkLWloLWNvbTogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9WjA2NzkwMDgyT1UwUE9QV09DUFo0XSUwQWF3c19pYW1fcm9sZS5yZWdpc3RyeS1ub2RlOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1yZWdpc3RyeS1ub2RlLTIwMjQwMzAzMDUyMTI2MDkwNzAwMDAwMDAyXSUwQW1vZHVsZS5yZWxlYXNlX2luZnJhaG91c2VfY29tW1wiamFtbXlcIl0uYXdzX3NlY3JldHNtYW5hZ2VyX3NlY3JldF92ZXJzaW9uLnBhc3NwaHJhc2U6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6c2VjcmV0c21hbmFnZXI6dXMtd2VzdC0xOjQ5MzM3MDgyNjQyNDpzZWNyZXQ6cGFja2FnZXItcGFzc3BocmFzZS1qYW1teS14YTZQVEd8RDZBQkNCMkItRjg1MC00NDg3LUE3NjQtMDcyNjM3MzYzMjNFXSUwQW1vZHVsZS5yZWxlYXNlX2luZnJhaG91c2VfY29tW1wiZm9jYWxcIl0uYXdzX3NlY3JldHNtYW5hZ2VyX3NlY3JldF92ZXJzaW9uLnBhc3NwaHJhc2U6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6c2VjcmV0c21hbmFnZXI6dXMtd2VzdC0xOjQ5MzM3MDgyNjQyNDpzZWNyZXQ6cGFja2FnZXItcGFzc3BocmFzZS1mb2NhbC1nenhRUHF8NjU4NkVCMTMtNzlDMi00MjRELUFGRUQtNjgxMEU2MTE1NkQ3XSUwQWRhdGEuYXdzX3NlY3JldHNtYW5hZ2VyX3NlY3JldF92ZXJzaW9uLnJlZ2lzdHJ5X2NsaWVudF9zZWNyZXQ6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPWFybjphd3M6c2VjcmV0c21hbmFnZXI6dXMtd2VzdC0xOjQ5MzM3MDgyNjQyNDpzZWNyZXQ6cmVnaXN0cnlfY2xpZW50X3NlY3JldDIwMjQwMzAyMjAzNzA4MDUxMDAwMDAwMDAxLVVBNHpSRXxBV1NDVVJSRU5UXSUwQW1vZHVsZS5wdXBwZXQtY29kZS1naXRodWIuYXdzX2lhbV9yb2xlLmdpdGh1YjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aWgtdGYtcHVwcGV0LWNvZGUtZ2l0aHViXSUwQW1vZHVsZS5rZXljbG9hay5hd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQuZWNzX3Rhc2tfZXhlY3V0aW9uX3JvbGVfcG9saWN5OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hdXRoVGFza0V4ZWN1dGlvblJvbGUtMjAyNDAzMDIyMjM2MzUxODEwMDAwMDAwMDhdJTBBbW9kdWxlLmluZnJhaG91c2UtdG9vbGtpdC1naXRodWIuYXdzX2lhbV9yb2xlLmdpdGh1YjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aWgtdGYtaW5mcmFob3VzZS10b29sa2l0LWdpdGh1Yl0lMEFtb2R1bGUuZWNzLm1vZHVsZS5wb2QubW9kdWxlLndlYnNlcnZlcl9wcm9maWxlLmF3c19pYW1faW5zdGFuY2VfcHJvZmlsZS5wcm9maWxlOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD10ZXJyYWZvcm0tcmVnaXN0cnlfaW5zdGFuY2VdJTBBbW9kdWxlLmtleWNsb2FrLm1vZHVsZS5wb2QubW9kdWxlLndlYnNlcnZlcl9wcm9maWxlLmF3c19pYW1faW5zdGFuY2VfcHJvZmlsZS5wcm9maWxlOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hdXRoX2luc3RhbmNlXSUwQW1vZHVsZS5lY3MubW9kdWxlLnBvZC5kYXRhLmF3c19hbWkuc2VsZWN0ZWQ6IFJlYWRpbmcuLi4lMEFtb2R1bGUua2V5Y2xvYWsubW9kdWxlLnBvZC5kYXRhLmF3c19hbWkuc2VsZWN0ZWQ6IFJlYWRpbmcuLi4lMEFtb2R1bGUua2V5Y2xvYWsuZGF0YS5hd3Nfa2V5X3BhaXIuc3NoX2tleV9wYWlyOiBSZWFkaW5nLi4uJTBBbW9kdWxlLmVjcy5kYXRhLmF3c19rZXlfcGFpci5zc2hfa2V5X3BhaXI6IFJlYWRpbmcuLi4lMEFtb2R1bGUuanVtcGhvc3QubW9kdWxlLmp1bXBob3N0X3Byb2ZpbGUuYXdzX2lhbV9pbnN0YW5jZV9wcm9maWxlLnByb2ZpbGU6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWp1bXBob3N0LVp2MDFFbGhhamJCNl0lMEFtb2R1bGUuZWNzLmF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5lY3NfdGFza19leGVjdXRpb25fcm9sZV9wb2xpY3k6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXRlcnJhZm9ybS1yZWdpc3RyeVRhc2tFeGVjdXRpb25Sb2xlLTIwMjQwMzAyMTk0OTM1ODk3NzAwMDAwMDA5XSUwQW1vZHVsZS5tYW5hZ2VtZW50LmF3c19kZWZhdWx0X3JvdXRlX3RhYmxlLmRlZmF1bHQ6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXJ0Yi0wZDczMzgzYWZlYjZhZDE0Ml0lMEFtb2R1bGUuZWNzLm1vZHVsZS5wb2QuZGF0YS5hd3NfYW1pLnNlbGVjdGVkOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD1hbWktMGM1MzVlMjRhYmJmMTI3MzhdJTBBbW9kdWxlLm1hbmFnZW1lbnQuYXdzX2ludGVybmV0X2dhdGV3YXkuaWc6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWlndy0wNzkwOTBlMDllZDVkYjU4Ml0lMEFtb2R1bGUua2V5Y2xvYWsuZGF0YS5hd3Nfa2V5X3BhaXIuc3NoX2tleV9wYWlyOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD1rZXktMDlmZWJmMjEyYWM3NDYxYTFdJTBBbW9kdWxlLm1hbmFnZW1lbnQuYXdzX2RlZmF1bHRfc2VjdXJpdHlfZ3JvdXAuZGVmYXVsdDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9c2ctMDhiOTYwYjg1ZjU5OTYxMDBdJTBBbW9kdWxlLmtleWNsb2FrLm1vZHVsZS5wb2QuZGF0YS5hd3NfYW1pLnNlbGVjdGVkOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD1hbWktMGM1MzVlMjRhYmJmMTI3MzhdJTBBbW9kdWxlLm1hbmFnZW1lbnQuYXdzX3N1Ym5ldC5hbGxbXCIxMC4wLjMuMC8yNFwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9c3VibmV0LTA2Y2FmNzFjOGIwYWZkOTA5XSUwQW1vZHVsZS5tYW5hZ2VtZW50LmF3c19zdWJuZXQuYWxsW1wiMTAuMC4wLjAvMjRcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXN1Ym5ldC0wZGY4ODVkY2M5OTQxODc5OV0lMEFtb2R1bGUuZWNzLmRhdGEuYXdzX2tleV9wYWlyLnNzaF9rZXlfcGFpcjogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9a2V5LTA5ZmViZjIxMmFjNzQ2MWExXSUwQW1vZHVsZS5tYW5hZ2VtZW50LmF3c19zdWJuZXQuYWxsW1wiMTAuMC4xLjAvMjRcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXN1Ym5ldC0wZjkxZGQyNjc1ZTdhMTZjM10lMEFtb2R1bGUubWFuYWdlbWVudC5hd3Nfc3VibmV0LmFsbFtcIjEwLjAuMi4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1zdWJuZXQtMDRiODg0NWQ4OTZjNmViZGVdJTBBbW9kdWxlLm1hbmFnZW1lbnQuYXdzX3JvdXRlX3RhYmxlLmFsbFtcIjEwLjAuMS4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1ydGItMDY3YzMwZTY1ZGQ0MTA4ZTldJTBBbW9kdWxlLm1hbmFnZW1lbnQuYXdzX3JvdXRlX3RhYmxlLmFsbFtcIjEwLjAuMi4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1ydGItMGFjMWMyMzA5MWE1OGIwYmRdJTBBbW9kdWxlLm1hbmFnZW1lbnQuYXdzX3JvdXRlX3RhYmxlLmFsbFtcIjEwLjAuMy4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1ydGItMDMyYzc1NTQxOTIxYmQ4ZjFdJTBBbW9kdWxlLm1hbmFnZW1lbnQuYXdzX3JvdXRlX3RhYmxlLmFsbFtcIjEwLjAuMC4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1ydGItMDRhMTZlNzRkNWIxMmEzMzhdJTBBZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5pbmZyYWhvdXNlLWNvbS1naXRodWItYXNzdW1lOiBSZWFkaW5nLi4uJTBBZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5pbmZyYWhvdXNlLWNvbS1naXRodWItYXNzdW1lOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0xNzU0MjE0MTY0XSUwQW1vZHVsZS5pbmZyYWhvdXNlLXB1cHBldC1kYXRhLWdpdGh1Yi5hd3NfaWFtX3JvbGUuZ2l0aHViOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1paC10Zi1pbmZyYWhvdXNlLXB1cHBldC1kYXRhLWdpdGh1Yl0lMEFhd3Nfcm91dGU1M19yZWNvcmQuY2ktY2QtbnM6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPVowNzY2MjI1MUxIM1lSRjJFUk0zR19jaS1jZC5pbmZyYWhvdXNlLmNvbV9OU10lMEFtb2R1bGUuanVtcGhvc3QubW9kdWxlLmp1bXBob3N0X3Byb2ZpbGUuYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LnByb2ZpbGU6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWp1bXBob3N0LVp2MDFFbGhhamJCNjIwMjQwMjIzMDA1MTEyMDMyODAwMDAwMDA1LTIwMjQwMjIzMDA1MTEyNjkxMjAwMDAwMDA3XSUwQWF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC50YXNrX3JvbGU6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXJlZ2lzdHJ5LW5vZGUtMjAyNDAzMDMwNTIxMjYwOTA3MDAwMDAwMDItMjAyNDAzMDMwNTIxMjY2MDE0MDAwMDAwMDNdJTBBbW9kdWxlLmtleWNsb2FrLm1vZHVsZS5wb2QubW9kdWxlLndlYnNlcnZlcl9wcm9maWxlLmF3c19pYW1fcG9saWN5LnByb2ZpbGU6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6aWFtOjo0OTMzNzA4MjY0MjQ6cG9saWN5L2F1dGhfaW5zdGFuY2UyMDI0MDMwMjIyMzYzNDg1MzQwMDAwMDAwM10lMEFtb2R1bGUuZWNzLm1vZHVsZS5wb2QubW9kdWxlLndlYnNlcnZlcl9wcm9maWxlLmF3c19pYW1fcG9saWN5LnByb2ZpbGU6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6aWFtOjo0OTMzNzA4MjY0MjQ6cG9saWN5L3RlcnJhZm9ybS1yZWdpc3RyeV9pbnN0YW5jZTIwMjQwMzAyMTk0OTM1MDY3MjAwMDAwMDAxXSUwQW1vZHVsZS5qdW1waG9zdC5kYXRhLmF3c19yb3V0ZTUzX3pvbmUuanVtcGhvc3Rfem9uZTogUmVhZGluZy4uLiUwQW1vZHVsZS5yZWxlYXNlX2luZnJhaG91c2VfY29tW1wiamFtbXlcIl0uYXdzX3JvdXRlNTNfcmVjb3JkLmNlcnRfdmFsaWRhdGlvbltcInJlbGVhc2UtamFtbXkuaW5mcmFob3VzZS5jb21cIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPVowNzY2MjI1MUxIM1lSRjJFUk0zR19fMDQ3YWUyOTkyNWVjMDI5N2VhZWJmZWRkYzg4NmYyMzQucmVsZWFzZS1qYW1teS5pbmZyYWhvdXNlLmNvbS5fQ05BTUVdJTBBbW9kdWxlLnJlbGVhc2VfaW5mcmFob3VzZV9jb21bXCJmb2NhbFwiXS5hd3Nfcm91dGU1M19yZWNvcmQuY2VydF92YWxpZGF0aW9uW1wicmVsZWFzZS1mb2NhbC5pbmZyYWhvdXNlLmNvbVwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9WjA3NjYyMjUxTEgzWVJGMkVSTTNHX184N2YyZWFkM2FiZjY4MTM0YzQ5N2JmNTI3MThlMDdiMS5yZWxlYXNlLWZvY2FsLmluZnJhaG91c2UuY29tLl9DTkFNRV0lMEFhd3Nfc2VjdXJpdHlfZ3JvdXAua2V5Y2xvYWs6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXNnLTA3NDIyODEyNzI5ZTZkMmUxXSUwQW1vZHVsZS5tYW5hZ2VtZW50LmF3c19laXAubmF0X2VpcFtcIjEwLjAuMi4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1laXBhbGxvYy0wYTM5NDlhOGE1ZjA5NDE3MV0lMEFtb2R1bGUubWFuYWdlbWVudC5hd3NfZWlwLm5hdF9laXBbXCIxMC4wLjAuMC8yNFwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9ZWlwYWxsb2MtMDJiNDJlNzBkNTJhNWRiN2ZdJTBBbW9kdWxlLm1hbmFnZW1lbnQuYXdzX3JvdXRlLmRlZmF1bHRfbWFpbjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9ci1ydGItMGQ3MzM4M2FmZWI2YWQxNDIxMDgwMjg5NDk0XSUwQW1vZHVsZS5paC10Zi1hd3MtY29udHJvbC00OTMzNzA4MjY0MjQtYWRtaW4uZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5naXRodWItYXNzdW1lOiBSZWFkaW5nLi4uJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNC1hZG1pbi5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmdpdGh1Yi1hc3N1bWU6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTM5MTE4NDQ4NjhdJTBBbW9kdWxlLmloLXRmLWluZnJhaG91c2Utd2Vic2l0ZS1pbmZyYS1hZG1pbi5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmdpdGh1Yi1hc3N1bWU6IFJlYWRpbmcuLi4lMEFtb2R1bGUuaWgtdGYtaW5mcmFob3VzZS13ZWJzaXRlLWluZnJhLWFkbWluLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuZ2l0aHViLWFzc3VtZTogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9NzA5ODQxMzkxXSUwQW1vZHVsZS5tYW5hZ2VtZW50LmF3c192cGNfc2VjdXJpdHlfZ3JvdXBfZWdyZXNzX3J1bGUuZGVmYXVsdFswXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9c2dyLTBlMWVlYTRjZTViNzk4MDQ2XSUwQW1vZHVsZS5tYW5hZ2VtZW50LmF3c192cGNfc2VjdXJpdHlfZ3JvdXBfaW5ncmVzc19ydWxlLmRlZmF1bHRbMF06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXNnci0wNjE0MDA1M2FiYzYyYTExOV0lMEFhd3NfaWFtX3JvbGUuaW5mcmFob3VzZS1jb20tZ2l0aHViOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLWNvbS1naXRodWJdJTBBbW9kdWxlLmp1bXBob3N0Lm1vZHVsZS5qdW1waG9zdF91c2VyZGF0YS5kYXRhLmNsb3VkaW5pdF9jb25maWcuY29uZmlnOiBSZWFkaW5nLi4uJTBBbW9kdWxlLmp1bXBob3N0Lm1vZHVsZS5qdW1waG9zdF91c2VyZGF0YS5kYXRhLmNsb3VkaW5pdF9jb25maWcuY29uZmlnOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0xNzA5NjE4NzcwXSUwQW1vZHVsZS5qdW1waG9zdC5kYXRhLmF3c19yb3V0ZTUzX3pvbmUuanVtcGhvc3Rfem9uZTogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9WjA3NjYyMjUxTEgzWVJGMkVSTTNHXSUwQW1vZHVsZS5lY3MuYXdzX2Vjc190YXNrX2RlZmluaXRpb24uZWNzOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD10ZXJyYWZvcm0tcmVnaXN0cnldJTBBbW9kdWxlLmVjcy5tb2R1bGUucG9kLmRhdGEuYXdzX3JvdXRlNTNfem9uZS53ZWJzZXJ2ZXJfem9uZTogUmVhZGluZy4uLiUwQW1vZHVsZS5tYW5hZ2VtZW50LmF3c19yb3V0ZV90YWJsZV9hc3NvY2lhdGlvbi5wcml2YXRlX3J0X2Fzc29jW1wiMTAuMC4xLjAvMjRcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXJ0YmFzc29jLTA5OWI5NThhZjE5NDg1ZjJiXSUwQW1vZHVsZS5tYW5hZ2VtZW50LmF3c19yb3V0ZV90YWJsZV9hc3NvY2lhdGlvbi5wcml2YXRlX3J0X2Fzc29jW1wiMTAuMC4yLjAvMjRcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXJ0YmFzc29jLTAxNTIxNTAwNTYyZmQxN2IwXSUwQW1vZHVsZS5tYW5hZ2VtZW50LmF3c19yb3V0ZV90YWJsZV9hc3NvY2lhdGlvbi5wcml2YXRlX3J0X2Fzc29jW1wiMTAuMC4zLjAvMjRcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXJ0YmFzc29jLTAzNDE4ZjhlYmFjOGFhNDBiXSUwQW1vZHVsZS5tYW5hZ2VtZW50LmF3c19yb3V0ZV90YWJsZV9hc3NvY2lhdGlvbi5wcml2YXRlX3J0X2Fzc29jW1wiMTAuMC4wLjAvMjRcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXJ0YmFzc29jLTA4YTQxMDE2MGUyZGNjNTkyXSUwQW1vZHVsZS5tYW5hZ2VtZW50LmF3c19yb3V0ZS5zdWJuZXRfcHVibGljW1wiMTAuMC4yLjAvMjRcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXItcnRiLTBhYzFjMjMwOTFhNThiMGJkMTA4MDI4OTQ5NF0lMEFtb2R1bGUubWFuYWdlbWVudC5hd3Nfcm91dGUuc3VibmV0X3B1YmxpY1tcIjEwLjAuMC4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1yLXJ0Yi0wNGExNmU3NGQ1YjEyYTMzODEwODAyODk0OTRdJTBBbW9kdWxlLmtleWNsb2FrLm1vZHVsZS5wb2QuZGF0YS5hd3Nfcm91dGU1M196b25lLndlYnNlcnZlcl96b25lOiBSZWFkaW5nLi4uJTBBbW9kdWxlLmVjcy5tb2R1bGUucG9kLmRhdGEuYXdzX3JvdXRlNTNfem9uZS53ZWJzZXJ2ZXJfem9uZTogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9WjA3NjYyMjUxTEgzWVJGMkVSTTNHXSUwQW1vZHVsZS5rZXljbG9hay5tb2R1bGUucG9kLm1vZHVsZS53ZWJzZXJ2ZXJfcHJvZmlsZS5hd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQucHJvZmlsZTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXV0aF9pbnN0YW5jZTIwMjQwMzAyMjIzNjM0ODUyMDAwMDAwMDAxLTIwMjQwMzAyMjIzNjM1MjEzODAwMDAwMDA5XSUwQW1vZHVsZS5lY3MubW9kdWxlLnBvZC5tb2R1bGUud2Vic2VydmVyX3Byb2ZpbGUuYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LnByb2ZpbGU6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXRlcnJhZm9ybS1yZWdpc3RyeV9pbnN0YW5jZTIwMjQwMzAyMTk0OTM1MDY5ODAwMDAwMDA3LTIwMjQwMzAyMTk0OTM1ODg0NjAwMDAwMDA4XSUwQW1vZHVsZS5paC10Zi1hd3MtY29udHJvbC00OTMzNzA4MjY0MjQtYWRtaW4uYXdzX2lhbV9yb2xlLmdpdGh1YjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aWgtdGYtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0LWdpdGh1Yl0lMEFtb2R1bGUuaWgtdGYtaW5mcmFob3VzZS13ZWJzaXRlLWluZnJhLWFkbWluLmF3c19pYW1fcm9sZS5naXRodWI6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWloLXRmLWluZnJhaG91c2Utd2Vic2l0ZS1pbmZyYS1naXRodWJdJTBBbW9kdWxlLnJlbGVhc2VfaW5mcmFob3VzZV9jb21bXCJqYW1teVwiXS5hd3NfYWNtX2NlcnRpZmljYXRlX3ZhbGlkYXRpb24ucmVwbzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9MjAyMy0wNy0yNCAxODo1MTozOS4wNTEgKzAwMDAgVVRDXSUwQW1vZHVsZS5yZWxlYXNlX2luZnJhaG91c2VfY29tW1wiZm9jYWxcIl0uYXdzX2FjbV9jZXJ0aWZpY2F0ZV92YWxpZGF0aW9uLnJlcG86IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPTIwMjMtMDctMjQgMTg6NTE6MzkuNDQyICswMDAwIFVUQ10lMEFtb2R1bGUucmVsZWFzZV9pbmZyYWhvdXNlX2NvbVtcImphbW15XCJdLmF3c19zM19idWNrZXRfcHVibGljX2FjY2Vzc19ibG9jay5yZXBvOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLXJlbGVhc2UtamFtbXldJTBBbW9kdWxlLnJlbGVhc2VfaW5mcmFob3VzZV9jb21bXCJmb2NhbFwiXS5hd3NfczNfYnVja2V0X3B1YmxpY19hY2Nlc3NfYmxvY2sucmVwbzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1yZWxlYXNlLWZvY2FsXSUwQW1vZHVsZS5yZWxlYXNlX2luZnJhaG91c2VfY29tW1wiamFtbXlcIl0uYXdzX3MzX29iamVjdC5kaXN0cmlidXRpb25zOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1jb25mL2Rpc3RyaWJ1dGlvbnNdJTBBbW9kdWxlLnJlbGVhc2VfaW5mcmFob3VzZV9jb21bXCJmb2NhbFwiXS5hd3NfczNfb2JqZWN0LmRpc3RyaWJ1dGlvbnM6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWNvbmYvZGlzdHJpYnV0aW9uc10lMEFtb2R1bGUua2V5Y2xvYWsubW9kdWxlLnBvZC5kYXRhLmF3c19yb3V0ZTUzX3pvbmUud2Vic2VydmVyX3pvbmU6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPVowNzY2MjI1MUxIM1lSRjJFUk0zR10lMEFtb2R1bGUucmVsZWFzZV9pbmZyYWhvdXNlX2NvbVtcImphbW15XCJdLmF3c19zM19idWNrZXRfb3duZXJzaGlwX2NvbnRyb2xzLnJlcG86IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtcmVsZWFzZS1qYW1teV0lMEFtb2R1bGUucmVsZWFzZV9pbmZyYWhvdXNlX2NvbVtcImZvY2FsXCJdLmF3c19zM19idWNrZXRfb3duZXJzaGlwX2NvbnRyb2xzLnJlcG86IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtcmVsZWFzZS1mb2NhbF0lMEFhd3NfZGJfc3VibmV0X2dyb3VwLmtleWNsb2FrOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1rZXljbG9hazIwMjQwMzAzMTc0ODU2ODA4MDAwMDAwMDAxXSUwQW1vZHVsZS5tYW5hZ2VtZW50LmF3c19uYXRfZ2F0ZXdheS5uYXRfZ3dbXCIxMC4wLjAuMC8yNFwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9bmF0LTA4ZmI5YjUyNjgzMjc3OTQ3XSUwQW1vZHVsZS5tYW5hZ2VtZW50LmF3c19uYXRfZ2F0ZXdheS5uYXRfZ3dbXCIxMC4wLjIuMC8yNFwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9bmF0LTBkNGUyZWU5NjQ1MmQ4NmZlXSUwQW1vZHVsZS5lY3MubW9kdWxlLnBvZC5hd3NfYWNtX2NlcnRpZmljYXRlLndlYnNpdGU6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6YWNtOnVzLXdlc3QtMTo0OTMzNzA4MjY0MjQ6Y2VydGlmaWNhdGUvMzJhN2IzOTEtNGNjMy00OGZmLThmYzEtM2Y0OTk0YTliMzUxXSUwQW1vZHVsZS5yZWxlYXNlX2luZnJhaG91c2VfY29tW1wiamFtbXlcIl0uYXdzX3MzX2J1Y2tldF9vd25lcnNoaXBfY29udHJvbHMucmVwby1sb2dzOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLXJlbGVhc2UtamFtbXktbG9nc10lMEFtb2R1bGUucmVsZWFzZV9pbmZyYWhvdXNlX2NvbVtcImZvY2FsXCJdLmF3c19zM19idWNrZXRfb3duZXJzaGlwX2NvbnRyb2xzLnJlcG8tbG9nczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1yZWxlYXNlLWZvY2FsLWxvZ3NdJTBBbW9kdWxlLnJlbGVhc2VfaW5mcmFob3VzZV9jb21bXCJqYW1teVwiXS5hd3NfczNfYnVja2V0X2xvZ2dpbmcuc2VydmVyLWxvZ3M6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtcmVsZWFzZS1qYW1teV0lMEFtb2R1bGUucmVsZWFzZV9pbmZyYWhvdXNlX2NvbVtcImZvY2FsXCJdLmF3c19zM19idWNrZXRfbG9nZ2luZy5zZXJ2ZXItbG9nczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1yZWxlYXNlLWZvY2FsXSUwQW1vZHVsZS5rZXljbG9hay5tb2R1bGUucG9kLmF3c19hY21fY2VydGlmaWNhdGUud2Vic2l0ZTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czphY206dXMtd2VzdC0xOjQ5MzM3MDgyNjQyNDpjZXJ0aWZpY2F0ZS84MzMyNjhmZS1jYjhlLTQ2MTMtOTdjYi0xZjE1NDg5NTJmMWFdJTBBYXdzX3ZwY19zZWN1cml0eV9ncm91cF9pbmdyZXNzX3J1bGUua2V5Y2xvYWstaWNtcDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9c2dyLTAzZTMyYzk0N2U5NWI5Y2ZhXSUwQWF3c192cGNfc2VjdXJpdHlfZ3JvdXBfaW5ncmVzc19ydWxlLmtleWNsb2FrLW15c3FsOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1zZ3ItMDZhZjA1Y2M4YWZkZmFlYWNdJTBBYXdzX3ZwY19zZWN1cml0eV9ncm91cF9lZ3Jlc3NfcnVsZS5rZXljbG9ha19vdXRnb2luZzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9c2dyLTA3ODk3NzgxMzczMmE2N2JkXSUwQW1vZHVsZS5paC10Zi1pbmZyYWhvdXNlLXdlYnNpdGUtaW5mcmEtYWRtaW4uZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5hZG1pbi1hc3N1bWU6IFJlYWRpbmcuLi4lMEFtb2R1bGUuaWgtdGYtaW5mcmFob3VzZS13ZWJzaXRlLWluZnJhLWFkbWluLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuYWRtaW4tYXNzdW1lOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0yNzE0MjYwMzc2XSUwQW1vZHVsZS5paC10Zi1pbmZyYWhvdXNlLXdlYnNpdGUtaW5mcmEtYWRtaW4uYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LmdpdGh1YjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aWgtdGYtaW5mcmFob3VzZS13ZWJzaXRlLWluZnJhLWdpdGh1Yi0yMDIzMDgxODAzNDE1MDk5MzQwMDAwMDAwMV0lMEFtb2R1bGUuanVtcGhvc3QuZGF0YS5hd3Nfc3VibmV0Lm5sYl9zZWxlY3RlZDogUmVhZGluZy4uLiUwQW1vZHVsZS5rZXljbG9hay5kYXRhLmF3c19zdWJuZXQuc2VsZWN0ZWQ6IFJlYWRpbmcuLi4lMEFtb2R1bGUuanVtcGhvc3QuZGF0YS5hd3Nfc3VibmV0LnNlbGVjdGVkOiBSZWFkaW5nLi4uJTBBbW9kdWxlLmVjcy5kYXRhLmF3c19zdWJuZXQuc2VsZWN0ZWQ6IFJlYWRpbmcuLi4lMEFtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0LWFkbWluLmF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5naXRodWI6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWloLXRmLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNC1naXRodWItMjAyMzA4MTcwMTA4MTgyNTgyMDAwMDAwMDFdJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNC1hZG1pbi5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmFkbWluLWFzc3VtZTogUmVhZGluZy4uLiUwQW1vZHVsZS5paC10Zi1hd3MtY29udHJvbC00OTMzNzA4MjY0MjQtYWRtaW4uZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5hZG1pbi1hc3N1bWU6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTI4OTk2Mjk5NTJdJTBBbW9kdWxlLnJlbGVhc2VfaW5mcmFob3VzZV9jb21bXCJmb2NhbFwiXS5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmJ1Y2tldC1hZG1pblsxXTogUmVhZGluZy4uLiUwQW1vZHVsZS5yZWxlYXNlX2luZnJhaG91c2VfY29tW1wiZm9jYWxcIl0uZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5idWNrZXQtYWRtaW5bMV06IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTM5NjczMTk2NzRdJTBBbW9kdWxlLnJlbGVhc2VfaW5mcmFob3VzZV9jb21bXCJmb2NhbFwiXS5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmJ1Y2tldC1hZG1pblsyXTogUmVhZGluZy4uLiUwQW1vZHVsZS5yZWxlYXNlX2luZnJhaG91c2VfY29tW1wiZm9jYWxcIl0uZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5idWNrZXQtYWRtaW5bMl06IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTIxNjYwMDM3MTRdJTBBbW9kdWxlLnJlbGVhc2VfaW5mcmFob3VzZV9jb21bXCJqYW1teVwiXS5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmJ1Y2tldC1hZG1pblswXTogUmVhZGluZy4uLiUwQW1vZHVsZS5yZWxlYXNlX2luZnJhaG91c2VfY29tW1wiamFtbXlcIl0uZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5idWNrZXQtYWRtaW5bMF06IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTU3MTUxMDIyMl0lMEFtb2R1bGUucmVsZWFzZV9pbmZyYWhvdXNlX2NvbVtcImphbW15XCJdLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuYnVja2V0LWFkbWluWzFdOiBSZWFkaW5nLi4uJTBBbW9kdWxlLnJlbGVhc2VfaW5mcmFob3VzZV9jb21bXCJqYW1teVwiXS5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmJ1Y2tldC1hZG1pblsxXTogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9MTI4Njc2MTY2NV0lMEFtb2R1bGUua2V5Y2xvYWsuZGF0YS5hd3Nfc3VibmV0LnNlbGVjdGVkOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD1zdWJuZXQtMGY5MWRkMjY3NWU3YTE2YzNdJTBBbW9kdWxlLmp1bXBob3N0LmRhdGEuYXdzX3N1Ym5ldC5ubGJfc2VsZWN0ZWQ6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPXN1Ym5ldC0wZGY4ODVkY2M5OTQxODc5OV0lMEFtb2R1bGUucmVsZWFzZV9pbmZyYWhvdXNlX2NvbVtcImphbW15XCJdLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuYnVja2V0LWFkbWluWzJdOiBSZWFkaW5nLi4uJTBBbW9kdWxlLnJlbGVhc2VfaW5mcmFob3VzZV9jb21bXCJqYW1teVwiXS5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmJ1Y2tldC1hZG1pblsyXTogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9NjI0NDE5MTFdJTBBbW9kdWxlLmp1bXBob3N0LmRhdGEuYXdzX3N1Ym5ldC5zZWxlY3RlZDogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9c3VibmV0LTBmOTFkZDI2NzVlN2ExNmMzXSUwQW1vZHVsZS5yZWxlYXNlX2luZnJhaG91c2VfY29tW1wiZm9jYWxcIl0uZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5idWNrZXQtYWRtaW5bMF06IFJlYWRpbmcuLi4lMEFtb2R1bGUubWFuYWdlbWVudC5hd3Nfcm91dGUuc3VibmV0X3ByaXZhdGVbXCIxMC4wLjEuMC8yNFwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9ci1ydGItMDY3YzMwZTY1ZGQ0MTA4ZTkxMDgwMjg5NDk0XSUwQW1vZHVsZS5yZWxlYXNlX2luZnJhaG91c2VfY29tW1wiZm9jYWxcIl0uZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5idWNrZXQtYWRtaW5bMF06IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTQxOTg4NDUzMThdJTBBbW9kdWxlLnJlbGVhc2VfaW5mcmFob3VzZV9jb21bXCJqYW1teVwiXS5hd3NfY2xvdWRmcm9udF9kaXN0cmlidXRpb24ucmVwbzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9RTFJSUxXSVkwT1U3OEJdJTBBbW9kdWxlLm1hbmFnZW1lbnQuYXdzX3JvdXRlLnN1Ym5ldF9wcml2YXRlW1wiMTAuMC4zLjAvMjRcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXItcnRiLTAzMmM3NTU0MTkyMWJkOGYxMTA4MDI4OTQ5NF0lMEFtb2R1bGUucmVsZWFzZV9pbmZyYWhvdXNlX2NvbVtcImZvY2FsXCJdLmF3c19jbG91ZGZyb250X2Rpc3RyaWJ1dGlvbi5yZXBvOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1FMTYxUUdDUEUzSklPS10lMEFtb2R1bGUuZWNzLmRhdGEuYXdzX3N1Ym5ldC5zZWxlY3RlZDogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9c3VibmV0LTBmOTFkZDI2NzVlN2ExNmMzXSUwQW1vZHVsZS5yZWxlYXNlX2luZnJhaG91c2VfY29tW1wiamFtbXlcIl0uYXdzX3MzX2J1Y2tldF9hY2wucmVwby1sb2dzOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLXJlbGVhc2UtamFtbXktbG9ncyxwcml2YXRlXSUwQW1vZHVsZS5yZWxlYXNlX2luZnJhaG91c2VfY29tW1wiZm9jYWxcIl0uYXdzX3MzX2J1Y2tldF9hY2wucmVwby1sb2dzOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLXJlbGVhc2UtZm9jYWwtbG9ncyxwcml2YXRlXSUwQW1vZHVsZS5paC10Zi1pbmZyYWhvdXNlLXdlYnNpdGUtaW5mcmEtYWRtaW4uYXdzX2lhbV9yb2xlLmFkbWluOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1paC10Zi1pbmZyYWhvdXNlLXdlYnNpdGUtaW5mcmEtYWRtaW5dJTBBbW9kdWxlLnJlbGVhc2VfaW5mcmFob3VzZV9jb21bXCJqYW1teVwiXS5hd3NfczNfYnVja2V0X2FjbC5yZXBvOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLXJlbGVhc2UtamFtbXkscHJpdmF0ZV0lMEFtb2R1bGUucmVsZWFzZV9pbmZyYWhvdXNlX2NvbVtcImZvY2FsXCJdLmF3c19zM19idWNrZXRfYWNsLnJlcG86IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtcmVsZWFzZS1mb2NhbCxwcml2YXRlXSUwQW1vZHVsZS5lY3MubW9kdWxlLnBvZC5kYXRhLmF3c19zdWJuZXQuc2VsZWN0ZWQ6IFJlYWRpbmcuLi4lMEFtb2R1bGUua2V5Y2xvYWsubW9kdWxlLnBvZC5kYXRhLmF3c19zdWJuZXQuc2VsZWN0ZWQ6IFJlYWRpbmcuLi4lMEFtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0LWFkbWluLmF3c19pYW1fcm9sZS5hZG1pbjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aWgtdGYtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0LWFkbWluXSUwQW1vZHVsZS5rZXljbG9hay5hd3Nfc2VjdXJpdHlfZ3JvdXAuYmFja2VuZF9leHRyYTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9c2ctMDhjY2E4MmIyNTYyM2Q0ZWVdJTBBbW9kdWxlLmp1bXBob3N0LmRhdGEuYXdzX3ZwYy5ubGJfc2VsZWN0ZWQ6IFJlYWRpbmcuLi4lMEFtb2R1bGUuanVtcGhvc3QuYXdzX3NlY3VyaXR5X2dyb3VwLmVmczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9c2ctMDI5MDZiMzZjOWQxYmUxNTZdJTBBbW9kdWxlLmp1bXBob3N0LmF3c19zZWN1cml0eV9ncm91cC5qdW1waG9zdDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9c2ctMGJjOGYyZmVkYTM2MjBmNmZdJTBBbW9kdWxlLmp1bXBob3N0LmRhdGEuYXdzX3ZwYy5zZWxlY3RlZDogUmVhZGluZy4uLiUwQW1vZHVsZS5rZXljbG9hay5tb2R1bGUucG9kLmRhdGEuYXdzX3N1Ym5ldC5zZWxlY3RlZDogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9c3VibmV0LTBkZjg4NWRjYzk5NDE4Nzk5XSUwQW1vZHVsZS5lY3MuYXdzX3NlY3VyaXR5X2dyb3VwLmJhY2tlbmRfZXh0cmE6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXNnLTBkZjk3ZTA0ZWVlMThjYzcyXSUwQW1vZHVsZS5lY3MubW9kdWxlLnBvZC5kYXRhLmF3c19zdWJuZXQuc2VsZWN0ZWQ6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPXN1Ym5ldC0wZGY4ODVkY2M5OTQxODc5OV0lMEFtb2R1bGUucmVsZWFzZV9pbmZyYWhvdXNlX2NvbVtcImphbW15XCJdLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuYnVja2V0LWNsb3VkZnJvbnQtYWNjZXNzOiBSZWFkaW5nLi4uJTBBbW9kdWxlLnJlbGVhc2VfaW5mcmFob3VzZV9jb21bXCJqYW1teVwiXS5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmJ1Y2tldC1jbG91ZGZyb250LWFjY2VzczogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9MTMzMDg1MTE3XSUwQW1vZHVsZS5yZWxlYXNlX2luZnJhaG91c2VfY29tW1wiZm9jYWxcIl0uZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5idWNrZXQtY2xvdWRmcm9udC1hY2Nlc3M6IFJlYWRpbmcuLi4lMEFtb2R1bGUucmVsZWFzZV9pbmZyYWhvdXNlX2NvbVtcImZvY2FsXCJdLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuYnVja2V0LWNsb3VkZnJvbnQtYWNjZXNzOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0zODcyNTQ2NjQ0XSUwQW1vZHVsZS5yZWxlYXNlX2luZnJhaG91c2VfY29tW1wiamFtbXlcIl0uYXdzX3JvdXRlNTNfcmVjb3JkLnJlcG86IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPVowNzY2MjI1MUxIM1lSRjJFUk0zR19yZWxlYXNlLWphbW15LmluZnJhaG91c2UuY29tX0FdJTBBbW9kdWxlLnJlbGVhc2VfaW5mcmFob3VzZV9jb21bXCJmb2NhbFwiXS5hd3Nfcm91dGU1M19yZWNvcmQucmVwbzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9WjA3NjYyMjUxTEgzWVJGMkVSTTNHX3JlbGVhc2UtZm9jYWwuaW5mcmFob3VzZS5jb21fQV0lMEFtb2R1bGUuZWNzLm1vZHVsZS5wb2QuYXdzX3JvdXRlNTNfcmVjb3JkLmNlcnRfdmFsaWRhdGlvbltcInJlZ2lzdHJ5LmluZnJhaG91c2UuY29tXCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1aMDc2NjIyNTFMSDNZUkYyRVJNM0dfX2JlYzdkYWZkOGIwMDcxZDU2MzMyNzU0NDFmMzY5NzZlLnJlZ2lzdHJ5LmluZnJhaG91c2UuY29tLl9DTkFNRV0lMEFtb2R1bGUuaWgtdGYtaW5mcmFob3VzZS13ZWJzaXRlLWluZnJhLWFkbWluLmF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5hZG1pbjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aWgtdGYtaW5mcmFob3VzZS13ZWJzaXRlLWluZnJhLWFkbWluLTIwMjMwODE4MDM0MTU4OTg1MTAwMDAwMDAyXSUwQW1vZHVsZS5rZXljbG9hay5tb2R1bGUucG9kLmF3c19yb3V0ZTUzX3JlY29yZC5jZXJ0X3ZhbGlkYXRpb25bXCJhdXRoLmluZnJhaG91c2UuY29tXCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1aMDc2NjIyNTFMSDNZUkYyRVJNM0dfXzg5NmIzYzFmZGM2OWY5NTFmMjNjYmI4OWQ3NDU0OWU4LmF1dGguaW5mcmFob3VzZS5jb20uX0NOQU1FXSUwQW1vZHVsZS5paC10Zi1hd3MtY29udHJvbC00OTMzNzA4MjY0MjQtYWRtaW4uYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LmFkbWluOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1paC10Zi1hd3MtY29udHJvbC00OTMzNzA4MjY0MjQtYWRtaW4tMjAyMzA3MDkxNjQzMjEzMTk5MDAwMDAwMDFdJTBBbW9kdWxlLmtleWNsb2FrLm1vZHVsZS5wb2QuYXdzX3NlY3VyaXR5X2dyb3VwLmFsYjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9c2ctMDRhODc2MWE3NDgyNmI0ZjhdJTBBbW9kdWxlLmtleWNsb2FrLm1vZHVsZS5wb2QuZGF0YS5hd3NfdnBjLnNlcnZpY2U6IFJlYWRpbmcuLi4lMEFtb2R1bGUua2V5Y2xvYWsubW9kdWxlLnBvZC5hd3NfYWxiX3RhcmdldF9ncm91cC53ZWJzaXRlOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hcm46YXdzOmVsYXN0aWNsb2FkYmFsYW5jaW5nOnVzLXdlc3QtMTo0OTMzNzA4MjY0MjQ6dGFyZ2V0Z3JvdXAvdGYtMjAyNDAzMDIyMjM2MzQ4NjEzMDAwMDAwMDYvNzgxZWNlOTBiZGRkOGQ1OV0lMEFtb2R1bGUuZWNzLm1vZHVsZS5wb2QuYXdzX3NlY3VyaXR5X2dyb3VwLmFsYjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9c2ctMDQ4ZjIxZmEzNDk5ZDY5YWZdJTBBbW9kdWxlLmtleWNsb2FrLm1vZHVsZS5wb2QuYXdzX3NlY3VyaXR5X2dyb3VwLmJhY2tlbmQ6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXNnLTA2NTMzZTkwNmQ3ODRiMmE1XSUwQW1vZHVsZS5lY3MubW9kdWxlLnBvZC5kYXRhLmF3c192cGMuc2VydmljZTogUmVhZGluZy4uLiUwQW1vZHVsZS5lY3MubW9kdWxlLnBvZC5hd3Nfc2VjdXJpdHlfZ3JvdXAuYmFja2VuZDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9c2ctMDRiOTM2MzgzNGUxM2EyM2VdJTBBbW9kdWxlLmVjcy5tb2R1bGUucG9kLmF3c19hbGJfdGFyZ2V0X2dyb3VwLndlYnNpdGU6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6ZWxhc3RpY2xvYWRiYWxhbmNpbmc6dXMtd2VzdC0xOjQ5MzM3MDgyNjQyNDp0YXJnZXRncm91cC90Zi0yMDI0MDMwMjE5NDkzNTA2NzQwMDAwMDAwMi9jN2Y0MjdlMGUxZDIyOGZlXSUwQW1vZHVsZS5yZWxlYXNlX2luZnJhaG91c2VfY29tW1wiamFtbXlcIl0uZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5idWNrZXQtYWNjZXNzOiBSZWFkaW5nLi4uJTBBbW9kdWxlLnJlbGVhc2VfaW5mcmFob3VzZV9jb21bXCJqYW1teVwiXS5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmJ1Y2tldC1hY2Nlc3M6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTI5Mjk0MzQxMDldJTBBbW9kdWxlLnJlbGVhc2VfaW5mcmFob3VzZV9jb21bXCJmb2NhbFwiXS5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmJ1Y2tldC1hY2Nlc3M6IFJlYWRpbmcuLi4lMEFtb2R1bGUucmVsZWFzZV9pbmZyYWhvdXNlX2NvbVtcImZvY2FsXCJdLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuYnVja2V0LWFjY2VzczogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9NDIwOTEzMDYxOV0lMEFtb2R1bGUucmVsZWFzZV9pbmZyYWhvdXNlX2NvbVtcImphbW15XCJdLmF3c19zM19vYmplY3QuaW5kZXgtaHRtbDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5kZXguaHRtbF0lMEFtb2R1bGUucmVsZWFzZV9pbmZyYWhvdXNlX2NvbVtcImZvY2FsXCJdLmF3c19zM19vYmplY3QuaW5kZXgtaHRtbDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5kZXguaHRtbF0lMEFtb2R1bGUucmVsZWFzZV9pbmZyYWhvdXNlX2NvbVtcImphbW15XCJdLmF3c19zM19vYmplY3QuZGViLWdwZy1wdWJsaWMta2V5OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1ERUItR1BHLUtFWS1yZWxlYXNlLWphbW15LmluZnJhaG91c2UuY29tXSUwQW1vZHVsZS5yZWxlYXNlX2luZnJhaG91c2VfY29tW1wiZm9jYWxcIl0uYXdzX3MzX29iamVjdC5kZWItZ3BnLXB1YmxpYy1rZXk6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPURFQi1HUEctS0VZLXJlbGVhc2UtZm9jYWwuaW5mcmFob3VzZS5jb21dJTBBbW9kdWxlLmtleWNsb2FrLmF3c192cGNfc2VjdXJpdHlfZ3JvdXBfaW5ncmVzc19ydWxlLmJhY2tlbmRfZXh0cmFfcmVzZXJ2ZWQ6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXNnci0wODQzOWQ4Y2UxNzI1NTdiYV0lMEFtb2R1bGUuanVtcGhvc3QuZGF0YS5hd3NfdnBjLm5sYl9zZWxlY3RlZDogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9dnBjLTA4ZTE5ZDg1OWMyNmQxOGIyXSUwQW1vZHVsZS5rZXljbG9hay5hd3NfdnBjX3NlY3VyaXR5X2dyb3VwX2luZ3Jlc3NfcnVsZS5iYWNrZW5kX2V4dHJhX3VzZXI6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXNnci0wZmIyNjFmZTNmMzU1OTdmMV0lMEFtb2R1bGUuanVtcGhvc3QuYXdzX3ZwY19zZWN1cml0eV9ncm91cF9lZ3Jlc3NfcnVsZS5lZnM6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXNnci0wZGIxOGJjNjNlZTU3NjQ0NV0lMEFtb2R1bGUuanVtcGhvc3QuYXdzX2Vmc19tb3VudF90YXJnZXQucGFja2FnZXNbXCJzdWJuZXQtMDZjYWY3MWM4YjBhZmQ5MDlcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWZzbXQtMDU2NjhkMDZmZGE1Yjk2YjZdJTBBbW9kdWxlLmp1bXBob3N0LmF3c19lZnNfbW91bnRfdGFyZ2V0LnBhY2thZ2VzW1wic3VibmV0LTBmOTFkZDI2NzVlN2ExNmMzXCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1mc210LTBkMDI1Y2ZjOWM3ZWUyODUyXSUwQW1vZHVsZS5qdW1waG9zdC5kYXRhLmF3c192cGMuc2VsZWN0ZWQ6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPXZwYy0wOGUxOWQ4NTljMjZkMThiMl0lMEFtb2R1bGUuanVtcGhvc3QuYXdzX3ZwY19zZWN1cml0eV9ncm91cF9pbmdyZXNzX3J1bGUuaWNtcDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9c2dyLTAzMzU5NTJlYTRhYzE3NDY1XSUwQW1vZHVsZS5qdW1waG9zdC5hd3NfdnBjX3NlY3VyaXR5X2dyb3VwX2luZ3Jlc3NfcnVsZS5lZnNfaWNtcDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9c2dyLTA1MTUyMDcxYWIyZjdiOWUzXSUwQW1vZHVsZS5qdW1waG9zdC5hd3NfbGF1bmNoX3RlbXBsYXRlLmp1bXBob3N0OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1sdC0wMDE3NDNkMWQyMjU3YzQwYl0lMEFtb2R1bGUuanVtcGhvc3QuYXdzX3ZwY19zZWN1cml0eV9ncm91cF9lZ3Jlc3NfcnVsZS5kZWZhdWx0OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1zZ3ItMDlkZjNhOGVhMDg2ZjQxYzNdJTBBbW9kdWxlLmtleWNsb2FrLm1vZHVsZS5wb2QuZGF0YS5hd3NfdnBjLnNlcnZpY2U6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPXZwYy0wOGUxOWQ4NTljMjZkMThiMl0lMEFtb2R1bGUuanVtcGhvc3QuYXdzX3ZwY19zZWN1cml0eV9ncm91cF9pbmdyZXNzX3J1bGUuc3NoOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1zZ3ItMDgyMTRkOTNlZTcyMTJiNjBdJTBBbW9kdWxlLmVjcy5tb2R1bGUucG9kLmRhdGEuYXdzX3ZwYy5zZXJ2aWNlOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD12cGMtMDhlMTlkODU5YzI2ZDE4YjJdJTBBbW9kdWxlLmp1bXBob3N0LmF3c19sYi5qdW1waG9zdDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czplbGFzdGljbG9hZGJhbGFuY2luZzp1cy13ZXN0LTE6NDkzMzcwODI2NDI0OmxvYWRiYWxhbmNlci9uZXQvanVtcGhvMjAyNDAyMjYxNzU0MDM4ODAyMDAwMDAwMDMvYjNmYzc0OWQ5OWUxYWVhNl0lMEFhd3NfZGJfaW5zdGFuY2Uua2V5Y2xvYWs6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWRiLVdOWUhUSkpTUURaVUFPSkZERzRDRExJWFBRXSUwQW1vZHVsZS5lY3MuYXdzX3ZwY19zZWN1cml0eV9ncm91cF9pbmdyZXNzX3J1bGUuYmFja2VuZF9leHRyYV9yZXNlcnZlZDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9c2dyLTAwMGVjZWJmNzUwZmMxYmYxXSUwQW1vZHVsZS5lY3MuYXdzX3ZwY19zZWN1cml0eV9ncm91cF9pbmdyZXNzX3J1bGUuYmFja2VuZF9leHRyYV91c2VyOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1zZ3ItMDJiNTI5OTNkMzI1MGQzYTBdJTBBbW9kdWxlLmtleWNsb2FrLm1vZHVsZS5wb2QuYXdzX2FjbV9jZXJ0aWZpY2F0ZV92YWxpZGF0aW9uLndlYnNpdGU6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPTIwMjQtMDMtMDIgMjI6MzY6NTEuMDg3ICswMDAwIFVUQ10lMEFtb2R1bGUuZWNzLm1vZHVsZS5wb2QuYXdzX2FjbV9jZXJ0aWZpY2F0ZV92YWxpZGF0aW9uLndlYnNpdGU6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPTIwMjQtMDMtMDIgMTk6NDk6NTMuMDYzICswMDAwIFVUQ10lMEFtb2R1bGUua2V5Y2xvYWsubW9kdWxlLnBvZC5hd3NfdnBjX3NlY3VyaXR5X2dyb3VwX2VncmVzc19ydWxlLmFsYl9vdXRnb2luZzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9c2dyLTA4YzEyYTA0NWU4YmE5NzQ1XSUwQW1vZHVsZS5rZXljbG9hay5tb2R1bGUucG9kLmF3c19hbGIud2Vic2l0ZTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czplbGFzdGljbG9hZGJhbGFuY2luZzp1cy13ZXN0LTE6NDkzMzcwODI2NDI0OmxvYWRiYWxhbmNlci9hcHAvYXV0aDIwMjQwMzAyMjIzNjM2Nzg5MDAwMDAwMDBhL2EyNjU3OGNlNDFjODMxMGNdJTBBbW9kdWxlLmtleWNsb2FrLm1vZHVsZS5wb2QuYXdzX3ZwY19zZWN1cml0eV9ncm91cF9pbmdyZXNzX3J1bGUuYWxiX2xpc3RlbmVyX3BvcnQ6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXNnci0wY2M5MDI5OTBmZGUwNDE1Nl0lMEFtb2R1bGUua2V5Y2xvYWsubW9kdWxlLnBvZC5hd3NfdnBjX3NlY3VyaXR5X2dyb3VwX2luZ3Jlc3NfcnVsZS5hbGJfaWNtcDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9c2dyLTA1YjBjNDY3ZDBjYzYwODRhXSUwQW1vZHVsZS5rZXljbG9hay5tb2R1bGUucG9kLmF3c192cGNfc2VjdXJpdHlfZ3JvdXBfaW5ncmVzc19ydWxlLmh0dHBzOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1zZ3ItMDgwOTJhZTk4MjZjMzhlZTldJTBBbW9kdWxlLnJlbGVhc2VfaW5mcmFob3VzZV9jb21bXCJqYW1teVwiXS5hd3NfczNfYnVja2V0X3BvbGljeS5idWNrZXQtYWNjZXNzOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLXJlbGVhc2UtamFtbXldJTBBbW9kdWxlLnJlbGVhc2VfaW5mcmFob3VzZV9jb21bXCJmb2NhbFwiXS5hd3NfczNfYnVja2V0X3BvbGljeS5idWNrZXQtYWNjZXNzOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLXJlbGVhc2UtZm9jYWxdJTBBbW9kdWxlLmVjcy5tb2R1bGUucG9kLmF3c192cGNfc2VjdXJpdHlfZ3JvdXBfZWdyZXNzX3J1bGUuYWxiX291dGdvaW5nOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1zZ3ItMGZmODgwMTY5MTVhMDdmZGFdJTBBbW9kdWxlLmVjcy5tb2R1bGUucG9kLmF3c192cGNfc2VjdXJpdHlfZ3JvdXBfaW5ncmVzc19ydWxlLmFsYl9saXN0ZW5lcl9wb3J0OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1zZ3ItMGM1NTAxYWM5OWM3NzcwNzZdJTBBbW9kdWxlLmVjcy5tb2R1bGUucG9kLmF3c19hbGIud2Vic2l0ZTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czplbGFzdGljbG9hZGJhbGFuY2luZzp1cy13ZXN0LTE6NDkzMzcwODI2NDI0OmxvYWRiYWxhbmNlci9hcHAvdGVycmFmMjAyNDAzMDIxOTQ5MzYxMjk0MDAwMDAwMGEvMWYyMGIyMjVjMzI3ODI2Nl0lMEFtb2R1bGUuZWNzLm1vZHVsZS5wb2QuYXdzX3ZwY19zZWN1cml0eV9ncm91cF9pbmdyZXNzX3J1bGUuYWxiX2ljbXA6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXNnci0wZTEwYzU1MjNiMDBmN2MyM10lMEFtb2R1bGUuZWNzLm1vZHVsZS5wb2QuYXdzX3ZwY19zZWN1cml0eV9ncm91cF9pbmdyZXNzX3J1bGUuaHR0cHM6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXNnci0wYTMyZDRjZjRmZTlmZjRhZl0lMEFtb2R1bGUua2V5Y2xvYWsubW9kdWxlLnBvZC5hd3NfdnBjX3NlY3VyaXR5X2dyb3VwX2VncmVzc19ydWxlLmJhY2tlbmRfb3V0Z29pbmc6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXNnci0wODRhNGI0YTc5NTYyNzVlNl0lMEFtb2R1bGUua2V5Y2xvYWsubW9kdWxlLnBvZC5hd3NfdnBjX3NlY3VyaXR5X2dyb3VwX2luZ3Jlc3NfcnVsZS5iYWNrZW5kX3NzaF9pbnB1dDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9c2dyLTBlYzBlZWQ5ZjNkOGEzYWI3XSUwQW1vZHVsZS5rZXljbG9hay5tb2R1bGUucG9kLmF3c192cGNfc2VjdXJpdHlfZ3JvdXBfaW5ncmVzc19ydWxlLmJhY2tlbmRfaWNtcDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9c2dyLTBkYTk1ZDM2OGVjMGJjYmRiXSUwQW1vZHVsZS5lY3MubW9kdWxlLnBvZC5hd3NfdnBjX3NlY3VyaXR5X2dyb3VwX2luZ3Jlc3NfcnVsZS5iYWNrZW5kX3NzaF9pbnB1dDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9c2dyLTA3YTVkZWE1ZGJiMjkxYWFlXSUwQW1vZHVsZS5lY3MubW9kdWxlLnBvZC5hd3NfdnBjX3NlY3VyaXR5X2dyb3VwX2luZ3Jlc3NfcnVsZS5iYWNrZW5kX2ljbXA6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXNnci0wNDNkMDJkZGZiOTc0NTk4MF0lMEFtb2R1bGUuZWNzLm1vZHVsZS5wb2QuYXdzX3ZwY19zZWN1cml0eV9ncm91cF9lZ3Jlc3NfcnVsZS5iYWNrZW5kX291dGdvaW5nOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1zZ3ItMGRlMTIxMTRkODBhZjAyZGVdJTBBbW9kdWxlLmtleWNsb2FrLm1vZHVsZS5wb2QuYXdzX2xhdW5jaF90ZW1wbGF0ZS53ZWJzaXRlOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1sdC0wZDkzMTM5YWIzMmRlNDNhYV0lMEFtb2R1bGUuanVtcGhvc3QuYXdzX2xiX3RhcmdldF9ncm91cC5qdW1waG9zdDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czplbGFzdGljbG9hZGJhbGFuY2luZzp1cy13ZXN0LTE6NDkzMzcwODI2NDI0OnRhcmdldGdyb3VwL2p1bXBobzIwMjQwMjI2MTc1NDAyOTAwMzAwMDAwMDAyL2U4MTliMzkxMzc0Zjg0N2VdJTBBbW9kdWxlLmp1bXBob3N0LmF3c192cGNfc2VjdXJpdHlfZ3JvdXBfaW5ncmVzc19ydWxlLmVmczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9c2dyLTAxMWUyZmVhNjZkNzRiOTlmXSUwQW1vZHVsZS5rZXljbG9hay5tb2R1bGUucG9kLmF3c192cGNfc2VjdXJpdHlfZ3JvdXBfaW5ncmVzc19ydWxlLmJhY2tlbmRfdXNlcl90cmFmZmljOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1zZ3ItMGQxNjgyMThlZmNiNzIxOWJdJTBBbW9kdWxlLmtleWNsb2FrLm1vZHVsZS5wb2QuYXdzX3ZwY19zZWN1cml0eV9ncm91cF9pbmdyZXNzX3J1bGUuYmFja2VuZF9zc2hfbG9jYWw6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXNnci0wYmJiNzkyMDJkZGUzZTgzZF0lMEFtb2R1bGUuZWNzLm1vZHVsZS5wb2QuYXdzX3ZwY19zZWN1cml0eV9ncm91cF9pbmdyZXNzX3J1bGUuYmFja2VuZF91c2VyX3RyYWZmaWM6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXNnci0wNmFlYzBlZjFkOTVhMTM3OF0lMEFtb2R1bGUuZWNzLm1vZHVsZS5wb2QuYXdzX3ZwY19zZWN1cml0eV9ncm91cF9pbmdyZXNzX3J1bGUuYmFja2VuZF9zc2hfbG9jYWw6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXNnci0wMDQ4OTNjN2UxY2Y0MjUwZl0lMEFtb2R1bGUuZWNzLm1vZHVsZS5wb2QuYXdzX2xhdW5jaF90ZW1wbGF0ZS53ZWJzaXRlOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1sdC0wYjMzOGUwNTk0ZTczZTExYV0lMEFtb2R1bGUuanVtcGhvc3QuYXdzX3JvdXRlNTNfcmVjb3JkLmp1bXBob3N0X2NuYW1lOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1aMDc2NjIyNTFMSDNZUkYyRVJNM0dfanVtcGhvc3QuaW5mcmFob3VzZS5jb21fQ05BTUVdJTBBbW9kdWxlLmtleWNsb2FrLm1vZHVsZS5wb2QuYXdzX2xiX2xpc3RlbmVyLnNzbDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czplbGFzdGljbG9hZGJhbGFuY2luZzp1cy13ZXN0LTE6NDkzMzcwODI2NDI0Omxpc3RlbmVyL2FwcC9hdXRoMjAyNDAzMDIyMjM2MzY3ODkwMDAwMDAwMGEvYTI2NTc4Y2U0MWM4MzEwYy85N2I1ZmZlNGM5ZTAwN2RmXSUwQW1vZHVsZS5rZXljbG9hay5tb2R1bGUucG9kLmF3c19hbGJfbGlzdGVuZXIucmVkaXJlY3RfdG9fc3NsOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hcm46YXdzOmVsYXN0aWNsb2FkYmFsYW5jaW5nOnVzLXdlc3QtMTo0OTMzNzA4MjY0MjQ6bGlzdGVuZXIvYXBwL2F1dGgyMDI0MDMwMjIyMzYzNjc4OTAwMDAwMDAwYS9hMjY1NzhjZTQxYzgzMTBjLzNmNDUzNjAxZDY3ZDQyMWVdJTBBbW9kdWxlLmtleWNsb2FrLm1vZHVsZS5wb2QuYXdzX3JvdXRlNTNfcmVjb3JkLmV4dHJhWzBdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1aMDc2NjIyNTFMSDNZUkYyRVJNM0dfYXV0aC5pbmZyYWhvdXNlLmNvbV9BXSUwQWRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQucGFja2FnZS1wdWJsaXNoZXI6IFJlYWRpbmcuLi4lMEFkYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnBhY2thZ2UtcHVibGlzaGVyOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD00MDUwMDA2MDM3XSUwQW1vZHVsZS5rZXljbG9hay5hd3NfZWNzX3Rhc2tfZGVmaW5pdGlvbi5lY3M6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWF1dGhdJTBBYXdzX2lhbV9wb2xpY3kucGFja2FnZS1wdWJsaXNoZXI6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6aWFtOjo0OTMzNzA4MjY0MjQ6cG9saWN5L3BhY2thZ2UtcHVibGlzaGVyXSUwQW1vZHVsZS5rZXljbG9hay5tb2R1bGUucG9kLmF3c19hdXRvc2NhbGluZ19ncm91cC53ZWJzaXRlOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hdXRoMjAyNDAzMDIyMjM2Mzc4NDk2MDAwMDAwMGRdJTBBbW9kdWxlLmVjcy5tb2R1bGUucG9kLmF3c19yb3V0ZTUzX3JlY29yZC5leHRyYVswXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9WjA3NjYyMjUxTEgzWVJGMkVSTTNHX3JlZ2lzdHJ5LmluZnJhaG91c2UuY29tX0FdJTBBbW9kdWxlLmVjcy5tb2R1bGUucG9kLmF3c19sYl9saXN0ZW5lci5zc2w6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6ZWxhc3RpY2xvYWRiYWxhbmNpbmc6dXMtd2VzdC0xOjQ5MzM3MDgyNjQyNDpsaXN0ZW5lci9hcHAvdGVycmFmMjAyNDAzMDIxOTQ5MzYxMjk0MDAwMDAwMGEvMWYyMGIyMjVjMzI3ODI2Ni8zYTExOWM5OWQ5Zjc0ZWFkXSUwQW1vZHVsZS5lY3MubW9kdWxlLnBvZC5hd3NfYWxiX2xpc3RlbmVyLnJlZGlyZWN0X3RvX3NzbDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czplbGFzdGljbG9hZGJhbGFuY2luZzp1cy13ZXN0LTE6NDkzMzcwODI2NDI0Omxpc3RlbmVyL2FwcC90ZXJyYWYyMDI0MDMwMjE5NDkzNjEyOTQwMDAwMDAwYS8xZjIwYjIyNWMzMjc4MjY2LzljNDE5ZTRhMTY5ZDYxZTFdJTBBYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LmluZnJhaG91c2UtdG9vbGtpdC1naXRodWI6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWloLXRmLWluZnJhaG91c2UtdG9vbGtpdC1naXRodWItMjAyNDAyMjkyMDUwMTk0Njc2MDAwMDAwMDFdJTBBYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LnB1cHBldC1jb2RlLWdpdGh1YjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aWgtdGYtcHVwcGV0LWNvZGUtZ2l0aHViLTIwMjMxMTA4MTMyMjQ4NTgzMTAwMDAwMDAxXSUwQWF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5pbmZyYWhvdXNlLXB1cHBldC1kYXRhLWdpdGh1YjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aWgtdGYtaW5mcmFob3VzZS1wdXBwZXQtZGF0YS1naXRodWItMjAyMzExMDgxMzMyMDAxNzU0MDAwMDAwMDFdJTBBYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LmluZnJhaG91c2UtY29tLWdpdGh1YjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1jb20tZ2l0aHViLTIwMjMwODE5MjE0MTM5NzU2MzAwMDAwMDAxXSUwQW1vZHVsZS5lY3MubW9kdWxlLnBvZC5hd3NfYXV0b3NjYWxpbmdfZ3JvdXAud2Vic2l0ZTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9dGVycmFmMjAyNDAzMDIxOTQ5MzY3NDUyMDAwMDAwMGRdJTBBbW9kdWxlLmp1bXBob3N0LmF3c19sYl9saXN0ZW5lci5qdW1waG9zdDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czplbGFzdGljbG9hZGJhbGFuY2luZzp1cy13ZXN0LTE6NDkzMzcwODI2NDI0Omxpc3RlbmVyL25ldC9qdW1waG8yMDI0MDIyNjE3NTQwMzg4MDIwMDAwMDAwMy9iM2ZjNzQ5ZDk5ZTFhZWE2LzkxYWNhOWQ1MDNjZTY0Y2NdJTBBbW9kdWxlLmp1bXBob3N0LmF3c19hdXRvc2NhbGluZ19ncm91cC5qdW1waG9zdDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9anVtcGhvc3QtMjAyNDAyMjMwMDUxMTMzNTkxMDAwMDAwMDktMDJSN0JaXSUwQW1vZHVsZS5rZXljbG9hay5tb2R1bGUucG9kLmF3c19hdXRvc2NhbGluZ19wb2xpY3kuY3B1X2xvYWQ6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWF1dGgyMDI0MDMwMjIyMzYzNzg0OTYwMDAwMDAwZF0lMEFtb2R1bGUua2V5Y2xvYWsuYXdzX2Vjc19jYXBhY2l0eV9wcm92aWRlci5lY3M6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6ZWNzOnVzLXdlc3QtMTo0OTMzNzA4MjY0MjQ6Y2FwYWNpdHktcHJvdmlkZXIvYXV0aF0lMEFtb2R1bGUuZWNzLm1vZHVsZS5wb2QuYXdzX2F1dG9zY2FsaW5nX3BvbGljeS5jcHVfbG9hZDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9dGVycmFmMjAyNDAzMDIxOTQ5MzY3NDUyMDAwMDAwMGRdJTBBbW9kdWxlLmVjcy5hd3NfZWNzX2NhcGFjaXR5X3Byb3ZpZGVyLmVjczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czplY3M6dXMtd2VzdC0xOjQ5MzM3MDgyNjQyNDpjYXBhY2l0eS1wcm92aWRlci90ZXJyYWZvcm0tcmVnaXN0cnldJTBBbW9kdWxlLmp1bXBob3N0LmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQucmVxdWlyZWRfcGVybWlzc2lvbnM6IFJlYWRpbmcuLi4lMEFtb2R1bGUuanVtcGhvc3QuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5yZXF1aXJlZF9wZXJtaXNzaW9uczogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9NDg1NDg3MzE0XSUwQW1vZHVsZS5qdW1waG9zdC5hd3NfaWFtX3BvbGljeS5yZXF1aXJlZDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czppYW06OjQ5MzM3MDgyNjQyNDpwb2xpY3kvdGVycmFmb3JtLTIwMjQwMjIzMDA1MTQ1OTI5ODAwMDAwMDE0XSUwQW1vZHVsZS5rZXljbG9hay5hd3NfZWNzX2NsdXN0ZXJfY2FwYWNpdHlfcHJvdmlkZXJzLmVjczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXV0aF0lMEFtb2R1bGUua2V5Y2xvYWsuYXdzX2Vjc19zZXJ2aWNlLmVjczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czplY3M6dXMtd2VzdC0xOjQ5MzM3MDgyNjQyNDpzZXJ2aWNlL2F1dGgvYXV0aF0lMEFtb2R1bGUuanVtcGhvc3QubW9kdWxlLmp1bXBob3N0X3Byb2ZpbGUuYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LmV4dHJhW1wicmVxdWlyZWRcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWp1bXBob3N0LVp2MDFFbGhhamJCNjIwMjQwMjIzMDA1MTEyMDMyODAwMDAwMDA1LTIwMjQwMjIzMDA1MTQ2MzI1MzAwMDAwMDE2XSUwQW1vZHVsZS5qdW1waG9zdC5tb2R1bGUuanVtcGhvc3RfcHJvZmlsZS5hd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQuZXh0cmFbXCJwYWNrYWdlLXB1Ymxpc2hlclwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9anVtcGhvc3QtWnYwMUVsaGFqYkI2MjAyNDAyMjMwMDUxMTIwMzI4MDAwMDAwMDUtMjAyNDAyMjMwMDUxNDYzMjAxMDAwMDAwMTVdJTBBbW9kdWxlLmVjcy5hd3NfZWNzX2NsdXN0ZXJfY2FwYWNpdHlfcHJvdmlkZXJzLmVjczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9dGVycmFmb3JtLXJlZ2lzdHJ5XSUwQW1vZHVsZS5lY3MuYXdzX2Vjc19zZXJ2aWNlLmVjczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czplY3M6dXMtd2VzdC0xOjQ5MzM3MDgyNjQyNDpzZXJ2aWNlL3RlcnJhZm9ybS1yZWdpc3RyeS90ZXJyYWZvcm0tcmVnaXN0cnldJTBBbW9kdWxlLmtleWNsb2FrLmF3c19hcHBhdXRvc2NhbGluZ190YXJnZXQuZWNzX3RhcmdldDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9c2VydmljZS9hdXRoL2F1dGhdJTBBbW9kdWxlLmVjcy5hd3NfYXBwYXV0b3NjYWxpbmdfdGFyZ2V0LmVjc190YXJnZXQ6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXNlcnZpY2UvdGVycmFmb3JtLXJlZ2lzdHJ5L3RlcnJhZm9ybS1yZWdpc3RyeV0lMEFtb2R1bGUuZWNzLmF3c19hcHBhdXRvc2NhbGluZ19wb2xpY3kuZWNzX3BvbGljeTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9Y3B1LWF1dG8tc2NhbGluZ10lMEFtb2R1bGUua2V5Y2xvYWsuYXdzX2FwcGF1dG9zY2FsaW5nX3BvbGljeS5lY3NfcG9saWN5OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1jcHUtYXV0by1zY2FsaW5nXSUwQSUwQVRlcnJhZm9ybSB1c2VkIHRoZSBzZWxlY3RlZCBwcm92aWRlcnMgdG8gZ2VuZXJhdGUgdGhlIGZvbGxvd2luZyBleGVjdXRpb24lMEFwbGFuLiBSZXNvdXJjZSBhY3Rpb25zIGFyZSBpbmRpY2F0ZWQgd2l0aCB0aGUgZm9sbG93aW5nIHN5bWJvbHM6JTBBICArIGNyZWF0ZSUwQSAgfiB1cGRhdGUgaW4tcGxhY2UlMEEtLysgZGVzdHJveSBhbmQgdGhlbiBjcmVhdGUgcmVwbGFjZW1lbnQlMEEgPD0gcmVhZCAoZGF0YSByZXNvdXJjZXMpJTBBJTBBVGVycmFmb3JtIHdpbGwgcGVyZm9ybSB0aGUgZm9sbG93aW5nIGFjdGlvbnM6JTBBJTBBICAjIGRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQucmVnaXN0cnlfbm9kZV9wZXJtaXNzaW9ucyB3aWxsIGJlIHJlYWQgZHVyaW5nIGFwcGx5JTBBICAjIChjb25maWcgcmVmZXJzIHRvIHZhbHVlcyBub3QgeWV0IGtub3duKSUwQSA8PSBkYXRhIFwiYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnRcIiBcInJlZ2lzdHJ5X25vZGVfcGVybWlzc2lvbnNcIiB7JTBBICAgICAgKyBpZCAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsganNvbiA9IChrbm93biBhZnRlciBhcHBseSklMEElMEEgICAgICArIHN0YXRlbWVudCB7JTBBICAgICAgICAgICsgYWN0aW9ucyAgID0gWyUwQSAgICAgICAgICAgICAgKyBcImR5bmFtb2RiOipcIiwlMEEgICAgICAgICAgICBdJTBBICAgICAgICAgICsgcmVzb3VyY2VzID0gWyUwQSAgICAgICAgICAgICAgKyBcIipcIiwlMEEgICAgICAgICAgICBdJTBBICAgICAgICB9JTBBICAgICAgKyBzdGF0ZW1lbnQgeyUwQSAgICAgICAgICArIGFjdGlvbnMgICA9IFslMEEgICAgICAgICAgICAgICsgXCJzMzoqXCIsJTBBICAgICAgICAgICAgXSUwQSAgICAgICAgICArIHJlc291cmNlcyA9IFslMEEgICAgICAgICAgICAgICsgKGtub3duIGFmdGVyIGFwcGx5KSwlMEEgICAgICAgICAgICBdJTBBICAgICAgICB9JTBBICAgICAgKyBzdGF0ZW1lbnQgeyUwQSAgICAgICAgICArIGFjdGlvbnMgICA9IFslMEEgICAgICAgICAgICAgICsgXCJzMzoqXCIsJTBBICAgICAgICAgICAgXSUwQSAgICAgICAgICArIHJlc291cmNlcyA9IFslMEEgICAgICAgICAgICAgICsgKGtub3duIGFmdGVyIGFwcGx5KSwlMEEgICAgICAgICAgICBdJTBBICAgICAgICB9JTBBICAgIH0lMEElMEEgICMgYXdzX2lhbV9wb2xpY3kucmVnaXN0cnlfbm9kZSB3aWxsIGJlIHVwZGF0ZWQgaW4tcGxhY2UlMEEgIH4gcmVzb3VyY2UgXCJhd3NfaWFtX3BvbGljeVwiIFwicmVnaXN0cnlfbm9kZVwiIHslMEEgICAgICAgIGlkICAgICAgICAgID0gXCJhcm46YXdzOmlhbTo6NDkzMzcwODI2NDI0OnBvbGljeS9yZWdpc3RyeS1ub2RlLTIwMjQwMzAzMDUyMTI2MDkwMzAwMDAwMDAxXCIlMEEgICAgICAgIG5hbWUgICAgICAgID0gXCJyZWdpc3RyeS1ub2RlLTIwMjQwMzAzMDUyMTI2MDkwMzAwMDAwMDAxXCIlMEEgICAgICB+IHBvbGljeSAgICAgID0ganNvbmVuY29kZSglMEEgICAgICAgICAgICB7JTBBICAgICAgICAgICAgICAtIFN0YXRlbWVudCA9IFslMEEgICAgICAgICAgICAgICAgICAtIHslMEEgICAgICAgICAgICAgICAgICAgICAgLSBBY3Rpb24gICA9IFwiZHluYW1vZGI6KlwiJTBBICAgICAgICAgICAgICAgICAgICAgIC0gRWZmZWN0ICAgPSBcIkFsbG93XCIlMEEgICAgICAgICAgICAgICAgICAgICAgLSBSZXNvdXJjZSA9IFwiKlwiJTBBICAgICAgICAgICAgICAgICAgICB9LCUwQSAgICAgICAgICAgICAgICBdJTBBICAgICAgICAgICAgICAtIFZlcnNpb24gICA9IFwiMjAxMi0xMC0xN1wiJTBBICAgICAgICAgICAgfSUwQSAgICAgICAgKSAtPiAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgICB0YWdzICAgICAgICA9IHt9JTBBICAgICAgICAjICg1IHVuY2hhbmdlZCBhdHRyaWJ1dGVzIGhpZGRlbiklMEEgICAgfSUwQSUwQSAgIyBhd3NfczNfYnVja2V0LnRlcnJhZm9ybS1yZWdpc3RyeSB3aWxsIGJlIGNyZWF0ZWQlMEEgICsgcmVzb3VyY2UgXCJhd3NfczNfYnVja2V0XCIgXCJ0ZXJyYWZvcm0tcmVnaXN0cnlcIiB7JTBBICAgICAgKyBhY2NlbGVyYXRpb25fc3RhdHVzICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBhY2wgICAgICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBhcm4gICAgICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBidWNrZXQgICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBidWNrZXRfZG9tYWluX25hbWUgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBidWNrZXRfcHJlZml4ICAgICAgICAgICAgICAgPSBcImluZnJhaG91c2UtdGVycmFmb3JtLXJlZ2lzdHJ5LVwiJTBBICAgICAgKyBidWNrZXRfcmVnaW9uYWxfZG9tYWluX25hbWUgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBmb3JjZV9kZXN0cm95ICAgICAgICAgICAgICAgPSBmYWxzZSUwQSAgICAgICsgaG9zdGVkX3pvbmVfaWQgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgaWQgICAgICAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgb2JqZWN0X2xvY2tfZW5hYmxlZCAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgcG9saWN5ICAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgcmVnaW9uICAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgcmVxdWVzdF9wYXllciAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgdGFnc19hbGwgICAgICAgICAgICAgICAgICAgID0geyUwQSAgICAgICAgICArIFwiY3JlYXRlZF9ieVwiICA9IFwiaW5mcmFob3VzZS9hd3MtY29udHJvbC00OTMzNzA4MjY0MjRcIiUwQSAgICAgICAgICArIFwiZW52aXJvbm1lbnRcIiA9IFwicHJvZHVjdGlvblwiJTBBICAgICAgICB9JTBBICAgICAgKyB3ZWJzaXRlX2RvbWFpbiAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyB3ZWJzaXRlX2VuZHBvaW50ICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgIH0lMEElMEEgICMgbW9kdWxlLmVjcy5hd3NfZWNzX3NlcnZpY2UuZWNzIHdpbGwgYmUgdXBkYXRlZCBpbi1wbGFjZSUwQSAgfiByZXNvdXJjZSBcImF3c19lY3Nfc2VydmljZVwiIFwiZWNzXCIgeyUwQSAgICAgICAgaWQgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICA9IFwiYXJuOmF3czplY3M6dXMtd2VzdC0xOjQ5MzM3MDgyNjQyNDpzZXJ2aWNlL3RlcnJhZm9ybS1yZWdpc3RyeS90ZXJyYWZvcm0tcmVnaXN0cnlcIiUwQSAgICAgICAgbmFtZSAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICA9IFwidGVycmFmb3JtLXJlZ2lzdHJ5XCIlMEEgICAgICAgIHRhZ3MgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSB7fSUwQSAgICAgIH4gdGFza19kZWZpbml0aW9uICAgICAgICAgICAgICAgICAgICA9IFwiYXJuOmF3czplY3M6dXMtd2VzdC0xOjQ5MzM3MDgyNjQyNDp0YXNrLWRlZmluaXRpb24vdGVycmFmb3JtLXJlZ2lzdHJ5OjhcIiAtPiAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgICAjICgxMyB1bmNoYW5nZWQgYXR0cmlidXRlcyBoaWRkZW4pJTBBJTBBICAgICAgICAjICg0IHVuY2hhbmdlZCBibG9ja3MgaGlkZGVuKSUwQSAgICB9JTBBJTBBICAjIG1vZHVsZS5lY3MuYXdzX2Vjc190YXNrX2RlZmluaXRpb24uZWNzIG11c3QgYmUgcmVwbGFjZWQlMEEtLysgcmVzb3VyY2UgXCJhd3NfZWNzX3Rhc2tfZGVmaW5pdGlvblwiIFwiZWNzXCIgeyUwQSAgICAgIH4gYXJuICAgICAgICAgICAgICAgICAgICAgID0gXCJhcm46YXdzOmVjczp1cy13ZXN0LTE6NDkzMzcwODI2NDI0OnRhc2stZGVmaW5pdGlvbi90ZXJyYWZvcm0tcmVnaXN0cnk6OFwiIC0+IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICB+IGFybl93aXRob3V0X3JldmlzaW9uICAgICA9IFwiYXJuOmF3czplY3M6dXMtd2VzdC0xOjQ5MzM3MDgyNjQyNDp0YXNrLWRlZmluaXRpb24vdGVycmFmb3JtLXJlZ2lzdHJ5XCIgLT4gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgIH4gY29udGFpbmVyX2RlZmluaXRpb25zICAgID0gKHNlbnNpdGl2ZSB2YWx1ZSkgIyBmb3JjZXMgcmVwbGFjZW1lbnQlMEEgICAgICB+IGlkICAgICAgICAgICAgICAgICAgICAgICA9IFwidGVycmFmb3JtLXJlZ2lzdHJ5XCIgLT4gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgbmV0d29ya19tb2RlICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgIC0gcmVxdWlyZXNfY29tcGF0aWJpbGl0aWVzID0gW10gLT4gbnVsbCUwQSAgICAgIH4gcmV2aXNpb24gICAgICAgICAgICAgICAgID0gOCAtPiAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgLSB0YWdzICAgICAgICAgICAgICAgICAgICAgPSB7fSAtPiBudWxsJTBBICAgICAgICAjICg2IHVuY2hhbmdlZCBhdHRyaWJ1dGVzIGhpZGRlbiklMEEgICAgfSUwQSUwQVBsYW46IDIgdG8gYWRkLCAyIHRvIGNoYW5nZSwgMSB0byBkZXN0cm95LiUwQSUwQVx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMCUwQSUwQVNhdmVkIHRoZSBwbGFuIHRvOiB0Zi5wbGFuJTBBJTBBVG8gcGVyZm9ybSBleGFjdGx5IHRoZXNlIGFjdGlvbnMsIHJ1biB0aGUgZm9sbG93aW5nIGNvbW1hbmQgdG8gYXBwbHk6JTBBICAgIHRlcnJhZm9ybSBhcHBseSBcInRmLnBsYW5cIiUwQVxuOjpkZWJ1Zzo6c3RkZXJyOiBcbjo6ZGVidWc6OmV4aXRjb2RlOiAwIiwgInN0ZGVyciI6ICIiLCAiYWRkIjogMiwgImNoYW5nZSI6IDIsICJkZXN0cm95IjogMX19```
</p></details>